export const dwCityCode = [{
        id: "35",
        name: "全省",
        children: [{
            id: '350000410000',
            name: '福建省公安厅反恐怖总队'
        }]
    },
    {
        id: "3501",
        name: "福州市",
        children: []
    },
    {
        id: "3502",
        name: "厦门市",
        children: []
    },
    {
        id: "3503",
        name: "莆田市",
        children: []
    },
    {
        id: "3504",
        name: "三明市",
        children: []
    },
    {
        id: "3505",
        name: "泉州市",
        children: []
    },
    {
        id: "3506",
        name: "漳州市",
        children: []
    },
    {
        id: "3507",
        name: "南平市",
        children: []
    },
    {
        id: "3508",
        name: "龙岩市",
        children: []
    },
    {
        id: "3509",
        name: "宁德市",
        children: []
    },
    {
        id: "3510",
        name: "平潭",
        children: []
    },
    {
        id: "3511",
        name: "福州铁路",
        children: []
    },
    {
        id: "3512",
        name: "厦门铁路",
        children: []
    }
]

export const shStatus = [{
    name: '已提交'
}, {
    name: '未提交'
}, {
    name: '审核通过'
}, {
    name: '审核未通过'
}, {
    name: '审批通过'
}, {
    name: '审批未通过'
}, ]

export const cityList = [{
        cityName: '福建省',
        cityCode: '35',
        children: [{
                cityCode: "3501",
                cityName: "福州市"
            },
            {
                cityCode: "3502",
                cityName: "厦门市"
            },
            {
                cityCode: "3503",
                cityName: "莆田市"
            },
            {
                cityCode: "3504",
                cityName: "三明市"
            },
            {
                cityCode: "3505",
                cityName: "泉州市"
            },
            {
                cityCode: "3506",
                cityName: "漳州市"
            },
            {
                cityCode: "3507",
                cityName: "南平市"
            },
            {
                cityCode: "3508",
                cityName: "龙岩市"
            },
            {
                cityCode: "3509",
                cityName: "宁德市"
            },
            {
                cityCode: "3510",
                cityName: "平潭"
            },
            {
                cityCode: "3511",
                cityName: "福州铁路"
            },
            {
                cityCode: "3512",
                cityName: "厦门铁路"
            }
        ]
    },
    {
        cityName: '福州市',
        cityCode: '3501',
        children: [{
                cityCode: "350102",
                cityName: "鼓楼区",
            },
            {
                cityCode: "350103",
                cityName: "台江区",
            },
            {
                cityCode: "350104",
                cityName: "仓山区",
            },
            {
                cityCode: "350105",
                cityName: "马尾区",
            },
            {
                cityCode: "350108",
                cityName: "上街区",
            },
            {
                cityCode: "350111",
                cityName: "晋安区",
            },
            {
                cityCode: "350121",
                cityName: "闽侯县",
            },
            {
                cityCode: "350122",
                cityName: "连江县",
            },
            {
                cityCode: "350123",
                cityName: "罗源县",
            },
            {
                cityCode: "350124",
                cityName: "闽清县",
            },
            {
                cityCode: "350125",
                cityName: "永泰县",
            },
            {
                cityCode: "350181",
                cityName: "福清市",
            },
            {
                cityCode: "350182",
                cityName: "长乐市",
            },
        ]
    },
    {
        cityName: '厦门市',
        cityCode: '3502',
        children: [
            // { cityCode: "350200", cityName: "厦门市", },
            {
                cityCode: "350203",
                cityName: "思明区",
            },
            {
                cityCode: "350205",
                cityName: "海沧区",
            },
            {
                cityCode: "350206",
                cityName: "湖里区",
            },
            {
                cityCode: "350211",
                cityName: "集美区",
            },
            {
                cityCode: "350212",
                cityName: "同安区",
            },
            {
                cityCode: "350213",
                cityName: "翔安区",
            },
            {
                cityCode: "350298",
                cityName: "厦门公共交通",
            },
            {
                cityCode: "350299",
                cityName: "高崎机场分局",
            },
        ]
    },
    {
        cityName: '莆田市',
        cityCode: '3503',
        children: [
            // { cityCode: "350300", cityName: "莆田市", },
            {
                cityCode: "350302",
                cityName: "城厢区",
            },
            {
                cityCode: "350303",
                cityName: "涵江区",
            },
            {
                cityCode: "350304",
                cityName: "荔城区",
            },
            {
                cityCode: "350305",
                cityName: "秀屿区",
            },
            {
                cityCode: "350306",
                cityName: "莆田湄洲湾开发区",
            },
            {
                cityCode: "350322",
                cityName: "仙游县",
            },
        ]
    },
    {
        cityName: '三明市',
        cityCode: '3504',
        children: [
            // { cityCode: "350400", cityName: "三明市", },
            {
                cityCode: "350402",
                cityName: "梅列区",
            },
            {
                cityCode: "350403",
                cityName: "三元区",
            },
            {
                cityCode: "350421",
                cityName: "明溪县",
            },
            {
                cityCode: "350423",
                cityName: "清流县",
            },
            {
                cityCode: "350424",
                cityName: "宁化县",
            },
            {
                cityCode: "350425",
                cityName: "大田县",
            },
            {
                cityCode: "350426",
                cityName: "尤溪县",
            },
            {
                cityCode: "350427",
                cityName: "沙县",
            },
            {
                cityCode: "350428",
                cityName: "将乐县",
            },
            {
                cityCode: "350429",
                cityName: "泰宁县",
            },
            {
                cityCode: "350430",
                cityName: "建宁县",
            },
            {
                cityCode: "350481",
                cityName: "永安市",
            },
        ]
    },
    {
        cityName: '泉州市',
        cityCode: '3505',
        children: [
            // { cityCode: "350500", cityName: "泉州市", },
            {
                cityCode: "350502",
                cityName: "鲤城区",
            },
            {
                cityCode: "350503",
                cityName: "丰泽区",
            },
            {
                cityCode: "350504",
                cityName: "洛江区",
            },
            {
                cityCode: "350505",
                cityName: "泉港区",
            },
            {
                cityCode: "350519",
                cityName: "泉州台商区",
            },
            {
                cityCode: "350521",
                cityName: "惠安县",
            },
            {
                cityCode: "350524",
                cityName: "安溪县",
            },
            {
                cityCode: "350525",
                cityName: "永春县",
            },
            {
                cityCode: "350526",
                cityName: "德化县",
            },
            {
                cityCode: "350581",
                cityName: "石狮市",
            },
            {
                cityCode: "350582",
                cityName: "晋江市",
            },
            {
                cityCode: "350583",
                cityName: "南安市",
            },
            {
                cityCode: "350596",
                cityName: "晋江国际机场",
            },
            {
                cityCode: "350597",
                cityName: "泉州开发区",
            },
            {
                cityCode: "350598",
                cityName: "油城",
            },
            {
                cityCode: "350599",
                cityName: "天湖山",
            },
        ]
    },
    {
        cityName: '漳州市',
        cityCode: '3506',
        children: [
            // { cityCode: "350600", cityName: "漳州市", },
            {
                cityCode: "350602",
                cityName: "芗城区",
            },
            {
                cityCode: "350603",
                cityName: "龙文区",
            },
            {
                cityCode: "350622",
                cityName: "云霄县",
            },
            {
                cityCode: "350623",
                cityName: "漳浦县",
            },
            {
                cityCode: "350624",
                cityName: "诏安县",
            },
            {
                cityCode: "350625",
                cityName: "长泰县",
            },
            {
                cityCode: "350626",
                cityName: "东山县",
            },
            {
                cityCode: "350627",
                cityName: "南靖县",
            },
            {
                cityCode: "350628",
                cityName: "平和县",
            },
            {
                cityCode: "350629",
                cityName: "华安县",
            },
            {
                cityCode: "350681",
                cityName: "龙海市",
            },
            {
                cityCode: "350698",
                cityName: "漳州台商区",
            },
            {
                cityCode: "350699",
                cityName: "漳州开发区",
            },
        ]
    },
    {
        cityName: '南平市',
        cityCode: '3507',
        children: [
            // { cityCode: "350700", cityName: "南平市", },
            {
                cityCode: "350702",
                cityName: "延平区",
            },
            {
                cityCode: "350721",
                cityName: "顺昌县",
            },
            {
                cityCode: "350722",
                cityName: "浦城县",
            },
            {
                cityCode: "350723",
                cityName: "光泽县",
            },
            {
                cityCode: "350724",
                cityName: "松溪县",
            },
            {
                cityCode: "350725",
                cityName: "政和县",
            },
            {
                cityCode: "350781",
                cityName: "邵武市",
            },
            {
                cityCode: "350782",
                cityName: "武夷山市",
            },
            {
                cityCode: "350783",
                cityName: "建瓯市",
            },
            {
                cityCode: "350784",
                cityName: "建阳区",
            },
        ]
    },
    {
        cityName: '龙岩市',
        cityCode: '3508',
        children: [
            // { cityCode: "350800", cityName: "龙岩市", },
            {
                cityCode: "350802",
                cityName: "新罗区",
            },
            {
                cityCode: "350821",
                cityName: "长汀县",
            },
            {
                cityCode: "350822",
                cityName: "永定区",
            },
            {
                cityCode: "350823",
                cityName: "上杭县",
            },
            {
                cityCode: "350824",
                cityName: "武平县",
            },
            {
                cityCode: "350825",
                cityName: "连城县",
            },
            {
                cityCode: "350881",
                cityName: "漳平市",
            },
        ]
    },
    {
        cityName: '宁德市',
        cityCode: '3509',
        children: [
            // { cityCode: "350900", cityName: "宁德市", },
            {
                cityCode: "350902",
                cityName: "蕉城区",
            },
            {
                cityCode: "350921",
                cityName: "霞浦县",
            },
            {
                cityCode: "350922",
                cityName: "古田县",
            },
            {
                cityCode: "350923",
                cityName: "屏南县",
            },
            {
                cityCode: "350924",
                cityName: "寿宁县",
            },
            {
                cityCode: "350925",
                cityName: "周宁县",
            },
            {
                cityCode: "350926",
                cityName: "柘荣县",
            },
            {
                cityCode: "350981",
                cityName: "福安市",
            },
            {
                cityCode: "350982",
                cityName: "福鼎市",
            },
            {
                cityCode: "350999",
                cityName: "东侨开发区",
            },
        ]
    },
    {
        cityName: '平潭',
        cityCode: '3510',
        children: [{
            cityCode: "351000",
            cityName: "平潭综合实验区",
        }, ]
    },
    {
        cityName: '福州铁路',
        cityCode: '3511',
        children: [{
            cityCode: "351100",
            cityName: "福州铁路",
        }, ]
    },
    {
        cityName: '厦门铁路',
        cityCode: '3512',
        children: [{
            cityCode: "351200",
            cityName: "厦门铁路"
        }, ]
    },
]
export const deptCode =  {
  "350000000000": "福建省公安厅", 
  "350000410000": "福建省公安厅反恐怖总队", 
  "350000412100": "福建省公安厅反恐怖总队一支队", 
  "350000412200": "福建省公安厅反恐怖总队二支队", 
  "350000412300": "福建省公安厅反恐怖总队三支队", 
  "350000412400": "福建省公安厅反恐怖总队四支队", 
  "35000041gafk": "公安部反恐局", 
  "350100000000": "福建省福州市", 
  "350100410000": "福州市公安局反恐怖支队", 
  "350100410100": "福州市公安局反恐怖支队综合队", 
  "350100410200": "福州市公安局反恐怖支队情报侦查队", 
  "350100410300": "福州市公安局反恐怖支队防范应急队", 
  "350102500000": "鼓楼分局巡特警反恐大队", 
  "350102500100": "鼓楼分局巡特警反恐大队综合队", 
  "350102500200": "鼓楼分局巡特警反恐大队反恐情报队", 
  "350102500300": "鼓楼分局巡特警反恐大队巡特警一队", 
  "350102500400": "鼓楼分局巡特警反恐大队巡特警二队", 
  "350103500000": "台江分局巡特警反恐大队", 
  "350103500100": "台江分局巡特警反恐大队综合队", 
  "350103500200": "台江分局巡特警反恐大队反恐情报队", 
  "350103500300": "台江分局巡特警反恐大队巡特警队", 
  "350104500000": "仓山分局巡特警反恐大队", 
  "350104500100": "仓山分局巡特警反恐大队综合队", 
  "350104500200": "仓山分局巡特警反恐大队反恐情报队", 
  "350104500300": "仓山分局巡特警反恐大队巡特警队", 
  "350105500000": "市马尾区巡特警反恐大队", 
  "350105500100": "马尾区巡特警反恐大队第一中队", 
  "350105500200": "马尾区巡特警反恐大队第二中队", 
  "350108500000": "上街（高新区）分局巡特警反恐大队", 
  "350108500100": "上街（高新区）分局巡特警反恐大队反恐情报队", 
  "350108500200": "上街（高新区）分局巡特警反恐大队巡特警队", 
  "350111500000": "晋安分局巡特警反恐大队", 
  "350111500100": "晋安分局巡特警反恐大队综合队",  
  "350111500200": "晋安分局巡特警反恐大队反恐情报队",  
  "350111500300": "晋安分局巡特警反恐大队巡特警队",  
  "350121500000": "闽侯县公安局巡特警反恐大队",  
  "350122500000": "连江县公安局巡特警反恐大队",  
  "350123500000": "罗源县公安局巡特警反恐大队",  
  "350124500000": "闽清县公安局巡特警反恐大队",  
  "350124500100": "闽清县公安局巡特警反恐大队综合管理中队",  
  "350124500200": "闽清县公安局巡特警反恐大队反恐处突中队",  
  "350124500300": "闽清县公安局巡特警反恐大队巡逻中队",  
  "350125500000": "永泰县公安局巡特警反恐大队",  
  "350181500000": "福清市公安局巡特警反恐大队",  
  "350182500000": "长乐市公安局巡特警反恐大队",  
  "350182500100": "长乐市公安局巡特警反恐大队综合中队",  
  "350182500200": "长乐市公安局巡特警反恐大队一中队",  
  "350182500300": "长乐市公安局巡特警反恐大队二中队",  
  "350200000000": "福建省厦门市",  
  "350200410000": "厦门市公安局反恐怖支队",  
  "350200410100": "厦门市公安局反恐怖支队一队",  
  "350200410200": "厦门市公安局反恐怖支队二队",  
  "350200410300": "厦门市公安局反恐怖支队三队",  
  "350200410400": "厦门市公安局反恐怖支队情报大队",  
  "350203500000": "思明分局巡特警反恐大队",  
  "350203500100": "厦思明分局巡特警反恐大队一中队",  
  "350203500200": "思明分局巡特警反恐大队二中队",  
  "350203500300": "思明分局巡特警反恐大队三中队",  
  "350205500000": "海沧分局巡特警反恐大队",  
  "350206500000": "湖里分局特警队",  
  "350206500100": "湖里分局巡特警反恐大队一中队",  
  "350206500200": "湖里分局巡特警反恐大队二中队",  
  "350206500300": "湖里分局巡特警反恐大队三中队",  
  "350211500000": "集美分局巡特警反恐大队",  
  "350212500000": "同安分局巡特警反恐大队",  
  "350213500000": "翔安分局巡特警反恐大队",  
  "350300000000": "福建省莆田市",  
  "350300410000": "莆田市公安局反恐怖支队",  
  "350300S04100": "莆田市森林公安局直属分局",  
  "350302500000": "城厢分局巡特警反恐大队",  
  "350303500000": "涵江分局巡特警反恐大队",  
  "350304500000": "荔城分局巡特警反恐大队",  
  "350305500000": "秀屿分局巡特警反恐大队",  
  "350306500000": "湄洲湾北岸经济开发区分局巡特警反恐大队",  
  "350322500000": "仙游县公安局巡特警反恐大队",  
  "350400000000": "福建省三明市",  
  "350400330000": "三明市公安局反恐维稳工作处",  
  "350400330100": "三明市公安局反恐维稳工作处情报侦查队",  
  "350402210000": "梅列分局巡特警反恐大队",  
  "350403210000": "三元分局巡特警反恐大队",  
  "350421210000": "明溪县巡特警反恐大队",  
  "350423210000": "清流县巡特警反恐大队",  
  "350424210000": "宁化县巡特警反恐大队",  
  "350424500100": "宁化县巡特警反恐大队一中队",  
  "350424500200": "宁化县巡特警反恐大队二中队",  
  "350424500300": "宁化县巡特警反恐大队三中队",  
  "350425210000": "大田县巡特警反恐大队",  
  "350426210000": "尤溪县巡特警反恐大队",  
  "350426500001": "尤溪县巡特警反恐大队特警中队",  
  "350426500002": "尤溪县巡特警反恐大队综合情报中队",  
  "350427210000": "沙县巡特警反恐大队",  
  "350428500000": "将乐县巡特警反恐大队",  
  "350429500000": "泰宁县巡特警反恐大队",  
  "350430210000": "建宁县巡特警反恐大队",  
  "350430500100": "建宁县巡特警反恐大队综合情报中队",  
  "350430500200": "建宁县巡特警反恐大队一中队",  
  "350430500300": "建宁县巡特警反恐大队二中队",  
  "350430500400": "建宁县巡特警反恐大队三中队",  
  "350481210000": "永安市巡特警反恐大队",  
  "350500000000": "福建省泉州市",  
  "350500410000": "泉州市公安局反恐怖支队",  
  "350502500000": "鲤城分局巡特警反恐大队",  
  "350503500000": "丰泽分局巡特警反恐大队",  
  "350504500000": "洛江分局巡特警反恐大队",  
  "350505500000": "泉港分局巡特警反恐大队",  
  "350519500000": "泉州台商投资区分局巡特警反恐大队",  
  "350521500000": "惠安县巡特警反恐大队",  
  "350521500100": "惠安县巡特警反恐大队综合室",  
  "350521500200": "惠安县巡特警反恐大队一中队（突击中队）",  
  "350521500300": "惠安县巡特警反恐大队二中队（特勤中队）",  
  "350521500400": "惠安县巡特警反恐大队三中队（反恐中队）",  
  "350521500500": "惠安县巡特警反恐大队四中队（警训中队）",  
  "350524500000": "安溪县巡特警反恐大队",  
  "350525500000": "永春县巡特警反恐大队",  
  "350525500100": "永春县巡特警反恐大队一中队",  
  "350525500200": "永春县巡特警反恐大队二中队",  
  "350525500300": "永春县巡特警反恐大队三中队",  
  "350526500000": "德化县巡特警反恐大队",  
  "350581500000": "石狮市公安局巡特警反恐大队",  
  "350582500000": "晋江巡特警反恐大队",  
  "350582500100": "晋江巡特警反恐大队综合科",  
  "350582500200": "晋江巡特警反恐大队一中队",  
  "350582500300": "晋江巡特警反恐大队二中队",  
  "350582500400": "晋江市巡特警反恐大队三中队",  
  "350582500500": "晋江巡特警反恐大队四中队",  
  "350583500000": "南安巡特警反恐大队",  
  "350596400600": "晋江国际机场分局巡特警反恐大队",  
  "350600000000": "福建省漳州市",  
  "350600330000": "漳州市公安局维稳反恐工作处",  
  "350600410000": "漳州市公安局反恐怖支队",  
  "350602500000": "芗城分局巡特警反恐大队",  
  "350602500100": "芗城分局巡特警反恐大队勤务室",  
  "350602500200": "芗城分局巡特警反恐大队一中队",  
  "350602500300": "芗城分局巡特警反恐大队二中队",  
  "350602500400": "芗城分局巡特警反恐大队三中队",  
  "350603500000": "龙文分局巡特警反恐大队",  
  "350603500100": "龙文分局巡特警反恐大队勤务室",  
  "350603500200": "龙文分局巡特警反恐大队一中队",  
  "350603500300": "龙文分局巡特警反恐大队二中队",  
  "350603500400": "龙文分局巡特警反恐大队三中队",  
  "350622500000": "云霄县巡特警反恐大队",  
  "350622500100": "云霄县巡特警反恐大队一中队",  
  "350622500200": "云霄县巡特警反恐大队二中队",  
  "350622500300": "云霄县巡特警反恐大队三中队",  
  "350623500000": "漳浦县巡特警反恐大队",  
  "350624500000": "诏安县巡特警反恐大队",  
  "350624500100": "诏安县巡特警反恐大队综合队",  
  "350624500200": "诏安县巡特警反恐大队应急处突特勤队",  
  "350624500300": "诏安县巡特警反恐大队巡防管控队",  
  "350625500000": "长泰县巡特警反恐大队",  
  "350625500100": "长泰县巡特警反恐大队一中队",  
  "350625500200": "长泰县巡特警反恐大队二中队",  
  "350625500300": "长泰县巡特警反恐大队三中队",  
  "350626500000": "东山县巡特警反恐大队",  
  "350626500100": "东山县巡特警反恐大队一中队",  
  "350626500200": "东山县巡特警反恐大队二中队",  
  "350626500300": "东山县巡特警反恐大队三中队",  
  "350627500000": "南靖县巡特警反恐大队",  
  "350628500000": "平和县巡特警反恐大队",  
  "350628500100": "平和县巡特警反恐大队综合中队",  
  "350628500200": "平和县巡特警反恐大队一中队",  
  "350628500300": "平和县巡特警反恐大队二中队",  
  "350628500400": "平和县巡特警反恐大队三中队",  
  "350629500000": "华安县巡特警反恐大队",  
  "350629500100": "华安县巡特警反恐大队一中队",  
  "350629500200": "华安县巡特警反恐大队二中队",  
  "350629500300": "华安县巡特警反恐大队三中队",  
  "350681500000": "龙海市巡特警反恐大队",  
  "350681500100": "龙海市巡特警反恐大队综合中队",  
  "350681500200": "龙海市巡特警反恐大队一中队",  
  "350681500300": "龙海市巡特警反恐大队二中队",  
  "350681500400": "龙海市巡特警反恐大队三中队",  
  "350681500500": "龙海市巡特警反恐大队四中队",  
  "350681500600": "龙海市巡特警反恐大队五中队",  
  "350698500000": "漳州台商投资区分局巡特警反恐大队",  
  "350700000000": "福建省南平市",  
  "350700410000": "南平市公安局反恐怖支队",  
  "350702500000": "延平分局巡特警反恐大队",  
  "350721500000": "顺昌县公安局巡特警反恐大队",  
  "350722500000": "浦城县巡特警反恐大队",  
  "350723230500": "光泽县巡特警反恐大队",  
  "350724500000": "松溪县巡特警反恐大队",  
  "350725500000": "政和县巡特警反恐大队",  
  "350781500000": "邵武市局巡特警反恐大队",  
  "350782500000": "武夷山市巡特警反恐大队",  
  "350783500000": "建瓯市巡特警反恐大队",  
  "350784500000": "建阳区巡特警反恐大队",  
  "350800000000": "福建省龙岩市",  
  "350800410000": "福建省龙岩市公安局反恐怖处",  
  "350800S04100": "龙岩市森林公安局梅花山国家级自然保护区直属分局",  
  "350802500000": "新罗分局巡特警反恐大队",  
  "350802500100": "新罗分局巡特警反恐大队勤务室",  
  "350802500300": "新罗分局巡特警反恐大队特警一中队",  
  "350802500400": "新罗分局巡特警反恐大队特警二中队",  
  "350802500500": "新罗分局巡特警反恐大队反恐中队",  
  "350821500000": "长汀县巡特警反恐大队",  
  "350821500100": "长汀县巡特警反恐大队综合室",  
  "350821500200": "长汀县巡特警反恐大队反恐中队",  
  "350821500300": "长汀县巡特警反恐大队巡逻防控中队",  
  "350821500400": "长汀县巡特警反恐大队特勤中队",  
  "350822500000": "永定分局巡特警反恐大队",  
  "350822500100": "永定分局巡特警反恐大队一中队",  
  "350822500200": "永定分局巡特警反恐大队二中队",  
  "350822500300": "永定分局巡特警反恐大队反恐中队",  
  "350822500400": "永定分局巡特警反恐大队综合勤务室",  
  "350823500000": "上杭县巡特警反恐大队",  
  "350823500100": "上杭县巡特警反恐大队综合勤务中队",  
  "350823500200": "上杭县巡特警反恐大队反恐中队",  
  "350823500300": "上杭县巡特警反恐大队巡逻防控中队",  
  "350823500400": "上杭县巡特警反恐大队特勤中队",  
  "350824500000": "武平县巡特警反恐大队",  
  "350825500000": "连城县巡特警反恐大队",  
  "350825500100": "连城县巡特警反恐大队综合勤务中队",  
  "350825500200": "连城县巡特警反恐大队应急处突中队",  
  "350825500300": "连城县巡特警反恐大队巡逻防控中队",  
  "350825500400": "连城县巡特警反恐大队巡逻反恐中队",  
  "350881500000": "漳平市巡特警反恐大队",  
  "350900000000": "福建省宁德市",  
  "350900330000": "宁德市公安局反恐怖支队",  
  "350902500000": "蕉城分局巡特警反恐大队",  
  "350921500000": "霞浦巡特警反恐大队",  
  "350922500000": "古田县巡特警反恐大队",  
  "350923500000": "屏南县巡特警反恐大队",  
  "350924500000": "寿宁县巡特警反恐大队",  
  "350925500000": "周宁县巡特警反恐大队",  
  "350926280000": "柘荣县巡警特警反恐大队",  
  "350981500000": "福安市巡特警反恐大队",  
  "350981500100": "福安市巡特警反恐大队综合中队",  
  "350981500200": "福安市巡特警反恐大队防暴反恐中队",  
  "350981500300": "福安市巡特警反恐大队武装巡逻中队",  
  "350981500400": "福安市巡特警反恐大队警情处置中队",  
  "350982210300": "福鼎市国内安全保卫大队维稳与反恐中队",  
  "350982500000": "福鼎市巡特警反恐大队",  
  "350999500000": "宁德东侨经济技术开发区分局巡特警反恐大队",  
  "351000000000": "平潭综合试验区公安局犯罪侦查支队",  
  "351001000000": "福建省平潭区",  
  "351100T00000": "福州铁路公安处",  
  "351100T02700": "福州铁路公安处反恐怖支队",  
  "351200T00000": "厦门铁路公安处",  
  "351200T02700": "厦门铁路公安处反恐怖支队",  
  "350102700022": "测试上下级部门门"
}
export const deptList = [{
        "id": "350000410000",
        "name": "福建省公安厅反恐怖总队",
        "pid": "350000000000",
        "pname": "福建省公安厅", 
    }, {
        "id": "350100410000",
        "name": "福建省福州市公安局反恐怖支队",
        "pid": "350000410000",
        "pname": "福建省公安厅反恐怖总队",
    }, {
        "id": "350200410000",
        "name": "福建省厦门市公安局反恐怖支队",
        "pid": "350000410000",
        "pname": "福建省公安厅反恐怖总队",
    }, {
        "id": "350300410000",
        "name": "福建省莆田市公安局反恐怖支队",
        "pid": "350000410000",
        "pname": "福建省公安厅反恐怖总队",
    }, {
        "id": "350400330000",
        "name": "福建省三明市公安局反恐维稳工作处",
        "pid": "350000410000",
        "pname": "福建省公安厅反恐怖总队",
    }, {
        "id": "350500410000",
        "name": "福建省泉州市公安局反恐怖支队",
        "pid": "350000410000",
        "pname": "福建省公安厅反恐怖总队",
    }, {
        "id": "350600410000",
        "name": "福建省漳州市公安局反恐怖支队",
        "pid": "350000410000",
        "pname": "福建省公安厅反恐怖总队",
    }, {
        "id": "350700410000",
        "name": "福建省南平市公安局反恐怖支队",
        "pid": "350000410000",
        "pname": "福建省公安厅反恐怖总队",
    }, {
        "id": "350800410000",
        "name": "福建省龙岩市公安局反恐怖处",
        "pid": "350000410000",
        "pname": "福建省公安厅反恐怖总队",
    },
    {
        "id": "350900330000",
        "name": "福建省宁德市公安局反恐怖支队",
        "pid": "350000410000",
        "pname": "福建省公安厅反恐怖总队",
    }, {
        "id": "351000240000",
        "name": "福建省平潭综合实验区公安局犯罪侦查支队",
        "pid": "350000410000",
        "pname": "福建省公安厅反恐怖总队",
    }, {
        "id": "350102500000",
        "name": "福建省福州市公安局鼓楼分局巡特警反恐大队",
        "pid": "350100410000",
        "pname": "福建省福州市公安局反恐怖支队",
    }, {
        "id": "350103500000",
        "name": "福建省福州市公安局台江分局巡特警反恐大队",
        "pid": "350100410000",
        "pname": "福建省福州市公安局反恐怖支队",
    }, {
        "id": "350104500000",
        "name": "福建省福州市公安局仓山分局巡特警反恐大队",
        "pid": "350100410000",
        "pname": "福建省福州市公安局反恐怖支队",
    }, {
        "id": "350105500000",
        "name": "福建省福州市马尾区巡特警反恐大队",
        "pid": "350100410000",
        "pname": "福建省福州市公安局反恐怖支队",
    }, {
        "id": "350108500000",
        "name": "福建省福州市公安局上街（高新区）分局巡特警反恐大队",
        "pid": "350100410000",
        "pname": "福建省福州市公安局反恐怖支队",
    }, {
        "id": "350111500000",
        "name": "福建省福州市公安局晋安分局巡特警反恐大队",
        "pid": "350100410000",
        "pname": "福建省福州市公安局反恐怖支队",
    },
    {
        "id": "350121500000",
        "name": "福建省闽侯县公安局巡特警反恐大队",
        "pid": "350100410000",
        "pname": "福建省福州市公安局反恐怖支队",
    }, {
        "id": "350122500000",
        "name": "福建省连江县公安局巡特警反恐大队",
        "pid": "350100410000",
        "pname": "福建省福州市公安局反恐怖支队",
    }, {
        "id": "350123500000",
        "name": "福建省罗源县公安局巡特警反恐大队",
        "pid": "350100410000",
        "pname": "福建省福州市公安局反恐怖支队",
    }, {
        "id": "350124500000",
        "name": "福建省闽清县公安局巡特警反恐大队",
        "pid": "350100410000",
        "pname": "福建省福州市公安局反恐怖支队",
    }, {
        "id": "350125500000",
        "name": "福建省永泰县公安局巡特警反恐大队",
        "pid": "350100410000",
        "pname": "福建省福州市公安局反恐怖支队",
    }, {
        "id": "350181500000",
        "name": "福建省福清市公安局巡特警反恐大队",
        "pid": "350100410000",
        "pname": "福建省福州市公安局反恐怖支队",
    },
    {
        "id": "350182500000",
        "name": "福建省长乐区公安局巡特警反恐大队",
        "pid": "350100410000",
        "pname": "福建省福州市公安局反恐怖支队",
    }, {
        "id": "350203500000",
        "name": "福建省厦门市公安局思明分局巡特警反恐大队",
        "pid": "350200410000",
        "pname": "福建省厦门市公安局反恐怖支队",
    }, {
        "id": "350205500000",
        "name": "福建省厦门市公安局海沧分局巡特警反恐大队",
        "pid": "350200410000",
        "pname": "福建省厦门市公安局反恐怖支队",
    }, {
        "id": "350206500000",
        "name": "福建省厦门市公安局湖里分局特警队",
        "pid": "350200410000",
        "pname": "福建省厦门市公安局反恐怖支队",
    }, {
        "id": "350211500000",
        "name": "福建省厦门市公安局集美分局巡特警反恐大队",
        "pid": "350200410000",
        "pname": "福建省厦门市公安局反恐怖支队",
    }, {
        "id": "350212500000",
        "name": "福建省厦门市公安局同安分局巡特警反恐大队",
        "pid": "350200410000",
        "pname": "福建省厦门市公安局反恐怖支队",
    }, {
        "id": "350213500000",
        "name": "福建省厦门市公安局翔安分局巡特警反恐大队",
        "pid": "350200410000",
        "pname": "福建省厦门市公安局反恐怖支队",
    }, {
        "id": "350298040000",
        "name": "福建省厦门市公安局公共交通分局办公室",
        "pid": "350200410000",
        "pname": "福建省厦门市公安局反恐怖支队",
    },
    {
        "id": "350299500000",
        "name": "福建省厦门市公安局高崎国际机场分局特警队",
        "pid": "350200410000",
        "pname": "福建省厦门市公安局反恐怖支队",
    }, {
        "id": "350302500000",
        "name": "福建省莆田市公安局城厢分局巡特警反恐大队",
        "pid": "350300410000",
        "pname": "福建省莆田市公安局反恐支队",
    }, {
        "id": "350303500000",
        "name": "福建省莆田市公安局涵江分局巡特警反恐大队",
        "pid": "350300410000",
        "pname": "福建省莆田市公安局反恐支队",
    }, {
        "id": "350304500000",
        "name": "福建省莆田市公安局荔城分局巡特警反恐大队",
        "pid": "350300410000",
        "pname": "福建省莆田市公安局反恐支队",
    }, {
        "id": "350305500000",
        "name": "福建省莆田市公安局秀屿分局巡特警反恐大队",
        "pid": "350300410000",
        "pname": "福建省莆田市公安局反恐支队",
    }, {
        "id": "350306500000",
        "name": "福建省莆田市公安局湄洲湾北岸经济开发区分局巡特警反恐大队",
        "pid": "350300410000",
        "pname": "福建省莆田市公安局反恐支队",
    },
    {
        "id": "350322500000",
        "name": "福建省仙游县公安局巡特警反恐大队",
        "pid": "350300410000",
        "pname": "福建省莆田市公安局反恐支队",
    }, {
        "id": "350402210000",
        "name": "福建省三明市公安局梅列分局巡特警反恐大队",
        "pid": "350400330000",
        "pname": "福建省三明市公安局反恐维稳工作处",
    },
    {
        "id": "350403210000",
        "name": "福建省三明市公安局三元分局巡特警反恐大队",
        "pid": "350400330000",
        "pname": "福建省三明市公安局反恐维稳工作处",
    }, {
        "id": "350421210000",
        "name": "福建省明溪县公安局巡特警反恐大队",
        "pid": "350400330000",
        "pname": "福建省三明市公安局反恐维稳工作处",
    }, {
        "id": "350423210000",
        "name": "福建省清流县公安局巡特警反恐大队",
        "pid": "350400330000",
        "pname": "福建省三明市公安局反恐维稳工作处",
    }, {
        "id": "350424210000",
        "name": "福建省宁化县公安局巡特警反恐大队",
        "pid": "350400330000",
        "pname": "福建省三明市公安局反恐维稳工作处",
    }, {
        "id": "350425210000",
        "name": "福建省大田县公安局巡特警反恐大队",
        "pid": "350400330000",
        "pname": "福建省三明市公安局反恐维稳工作处",
    }, {
        "id": "350426210000",
        "name": "福建省尤溪县公安局巡特警反恐大队",
        "pid": "350400330000",
        "pname": "福建省三明市公安局反恐维稳工作处",
    }, {
        "id": "350427210000",
        "name": "福建省沙县公安局巡特警反恐大队",
        "pid": "350400330000",
        "pname": "福建省三明市公安局反恐维稳工作处",
    },
    {
        "id": "350428500000",
        "name": "福建省将乐县公安局巡特警反恐大队",
        "pid": "350400330000",
        "pname": "福建省三明市公安局反恐维稳工作处",
    }, {
        "id": "350429500000",
        "name": "福建省泰宁县公安局巡特警反恐大队",
        "pid": "350400330000",
        "pname": "福建省三明市公安局反恐维稳工作处",
    }, {
        "id": "350430210000",
        "name": "福建省建宁县公安局巡特警反恐大队",
        "pid": "350400330000",
        "pname": "福建省三明市公安局反恐维稳工作处",
    }, {
        "id": "350481210000",
        "name": "福建省永安市公安局巡特警反恐大队",
        "pid": "350400330000",
        "pname": "福建省三明市公安局反恐维稳工作处",
    }, {
        "id": "350502500000",
        "name": "福建省泉州市公安局鲤城分局巡特警反恐大队",
        "pid": "350500410000",
        "pname": "福建省泉州市公安局反恐怖支队",
    }, {
        "id": "350503500000",
        "name": "福建省泉州市公安局丰泽分局巡特警反恐大队",
        "pid": "350500410000",
        "pname": "福建省泉州市公安局反恐怖支队",
    }, {
        "id": "350504500000",
        "name": "福建省泉州市公安局洛江分局巡特警反恐大队",
        "pid": "350500410000",
        "pname": "福建省泉州市公安局反恐怖支队",
    }, {
        "id": "350505500000",
        "name": "福建省泉州市公安局泉港分局巡特警反恐大队",
        "pid": "350500410000",
        "pname": "福建省泉州市公安局反恐怖支队",
    },
    {
        "id": "350519500000",
        "name": "福建省泉州市公安局台商投资区分局巡特警反恐大队",
        "pid": "350500410000",
        "pname": "福建省泉州市公安局反恐怖支队",
    }, {
        "id": "350521500000",
        "name": "福建省惠安县公安局巡特警反恐大队",
        "pid": "350500410000",
        "pname": "福建省泉州市公安局反恐怖支队",
    }, {
        "id": "350524500000",
        "name": "福建省安溪县公安局巡特警反恐大队",
        "pid": "350500410000",
        "pname": "福建省泉州市公安局反恐怖支队",
    }, {
        "id": "350525500000",
        "name": "福建省永春县巡特警反恐大队",
        "pid": "350500410000",
        "pname": "福建省泉州市公安局反恐怖支队",
    }, {
        "id": "350526500000",
        "name": "福建省德化县巡特警反恐大队",
        "pid": "350500410000",
        "pname": "福建省泉州市公安局反恐怖支队",
    }, {
        "id": "350581500000",
        "name": "福建省石狮市公安局巡特警反恐大队",
        "pid": "350500410000",
        "pname": "福建省泉州市公安局反恐怖支队",
    }, {
        "id": "350582500000",
        "name": "福建省晋江市公安局巡特警反恐大队",
        "pid": "350500410000",
        "pname": "福建省泉州市公安局反恐怖支队",
    }, {
        "id": "350583500000",
        "name": "福建省南安市公安局巡特警反恐大队",
        "pid": "350500410000",
        "pname": "福建省泉州市公安局反恐怖支队",
    }, {
        "id": "350596400600",
        "name": "福建省泉州市公安局晋江国际机场分局巡特警反恐大队",
        "pid": "350500410000",
        "pname": "福建省泉州市公安局反恐怖支队",
    },
    {
        "id": "350597000000",
        "name": "福建省泉州市公安局经济技术开发区分局",
        "pid": "350500000000",
        "pname": "福建省泉州市公安局",
    },
    {
        "id": "350597210000",
        "name": "福建省泉州市公安局经济技术开发区分局国保大队",
        "pid": "350500410000",
        "pname": "福建省泉州市公安局反恐怖支队",
    }, {
        "id": "350598230000",
        "name": "福建省泉州市公安局油城分局治安大队",
        "pid": "350500410000",
        "pname": "福建省泉州市公安局反恐怖支队",
    },
    {
        "id": "350599240000",
        "name": "福建省泉州市公安局天湖山分局刑侦大队",
        "pid": "350500410000",
        "pname": "福建省泉州市公安局反恐怖支队",
    }, {
        "id": "350602500000",
        "name": "福建省漳州市公安局芗城分局巡特警反恐大队",
        "pid": "350600410000",
        "pname": "福建省漳州市公安局反恐怖支队",
    }, {
        "id": "350603500000",
        "name": "福建省漳州市公安局龙文分局巡特警反恐大队",
        "pid": "350600410000",
        "pname": "福建省漳州市公安局反恐怖支队",
    }, {
        "id": "350622500000",
        "name": "福建省云霄县云霄县公安局巡特警反恐大队",
        "pid": "350600410000",
        "pname": "福建省漳州市公安局反恐怖支队",
    }, {
        "id": "350623500000",
        "name": "福建省漳浦县巡特警反恐大队",
        "pid": "350600410000",
        "pname": "福建省漳州市公安局反恐怖支队",
    }, {
        "id": "350624500000",
        "name": "福建省诏安县公安局巡特警反恐大队",
        "pid": "350600410000",
        "pname": "福建省漳州市公安局反恐怖支队",
    },
    {
        "id": "350625500000",
        "name": "福建省长泰县公安局巡特警反恐大队",
        "pid": "350600410000",
        "pname": "福建省漳州市公安局反恐怖支队",
    }, {
        "id": "350626500000",
        "name": "福建省东山县公安局巡特警反恐大队",
        "pid": "350600410000",
        "pname": "福建省漳州市公安局反恐怖支队",
    }, {
        "id": "350627500000",
        "name": "福建省南靖县公安局巡特警反恐大队",
        "pid": "350600410000",
        "pname": "福建省漳州市公安局反恐怖支队",
    }, {
        "id": "350628500000",
        "name": "福建省平和县公安局巡特警反恐大队",
        "pid": "350600410000",
        "pname": "福建省漳州市公安局反恐怖支队",
    }, {
        "id": "350629500000",
        "name": "福建省华安县公安局巡特警反恐大队",
        "pid": "350600410000",
        "pname": "福建省漳州市公安局反恐怖支队",
    }, {
        "id": "350630500000",
        "name": "漳州市公安局古雷治安办巡特警反恐维稳队",
        "pid": "350600410000",
        "pname": "福建省漳州市公安局反恐怖支队",
    }, {
        "id": "350681500000",
        "name": "福建省龙海市公安局巡特警反恐大队",
        "pid": "350600410000",
        "pname": "福建省漳州市公安局反恐怖支队",
    }, {
        "id": "350698500000",
        "name": "福建省漳州市公安局台商投资区分局巡特警反恐大队",
        "pid": "350600410000",
        "pname": "福建省漳州市公安局反恐怖支队",
    }, {
        "id": "350699230000",
        "name": "福建省漳州市公安局漳州开发区分局治安综合管理大队",
        "pid": "350600410000",
        "pname": "福建省漳州市公安局反恐怖支队",
    },
    {
        "id": "350702500000",
        "name": "福建省南平市公安局延平分局巡特警反恐大队",
        "pid": "350700410000",
        "pname": "福建省南平市公安局反恐怖支队",
    }, {
        "id": "350721500000",
        "name": "福建省顺昌县顺昌县公安局巡特警反恐大队",
        "pid": "350700410000",
        "pname": "福建省南平市公安局反恐怖支队",
    }, {
        "id": "350722500000",
        "name": "福建省浦城县公安局巡特警反恐大队",
        "pid": "350700410000",
        "pname": "福建省南平市公安局反恐怖支队",
    }, {
        "id": "350723230500",
        "name": "福建省光泽县公安局巡特警反恐大队",
        "pid": "350700410000",
        "pname": "福建省南平市公安局反恐怖支队",
    }, {
        "id": "350724500000",
        "name": "福建省松溪县公安局巡特警反恐大队",
        "pid": "350700410000",
        "pname": "福建省南平市公安局反恐怖支队",
    }, {
        "id": "350725500000",
        "name": "福建省政和县公安局巡特警反恐大队",
        "pid": "350700410000",
        "pname": "福建省南平市公安局反恐怖支队",
    }, {
        "id": "350781500000",
        "name": "福建省邵武市公安局巡特警反恐大队",
        "pid": "350700410000",
        "pname": "福建省南平市公安局反恐怖支队",
    }, {
        "id": "350782500000",
        "name": "福建省武夷山市公安局巡特警反恐大队",
        "pid": "350700410000",
        "pname": "福建省南平市公安局反恐怖支队",
    }, {
        "id": "350783500000",
        "name": "福建省建瓯市公安局巡特警反恐大队",
        "pid": "350700410000",
        "pname": "福建省南平市公安局反恐怖支队",
    },
    {
        "id": "350784500000",
        "name": "福建省南平市建阳区巡特警反恐大队",
        "pid": "350700410000",
        "pname": "福建省南平市公安局反恐怖支队",
    }, {
        "id": "350802500000",
        "name": "福建省龙岩市公安局新罗分局巡特警反恐大队",
        "pid": "350800410000",
        "pname": "福建省龙岩市公安局反恐处",
    },
    {
        "id": "350821500000",
        "name": "福建省长汀县公安局巡特警反恐大队",
        "pid": "350800410000",
        "pname": "福建省龙岩市公安局反恐处",
    },
    {
        "id": "350822500000",
        "name": "福建省龙岩市公安局永定分局巡特警反恐大队",
        "pid": "350800410000",
        "pname": "福建省龙岩市公安局反恐处",
    },
    {
        "id": "350823500000",
        "name": "福建省上杭县公安局巡特警反恐大队",
        "pid": "350800410000",
        "pname": "福建省龙岩市公安局反恐处",
    }, {
        "id": "350824500000",
        "name": "福建省武平县巡特警反恐大队",
        "pid": "350800410000",
        "pname": "福建省龙岩市公安局反恐处",
    }, {
        "id": "350825500000",
        "name": "福建省连城县公安局巡特警反恐大队",
        "pid": "350800410000",
        "pname": "福建省龙岩市公安局反恐处",
    }, {
        "id": "350881500000",
        "name": "福建省漳平市公安局巡特警反恐大队",
        "pid": "350800410000",
        "pname": "福建省龙岩市公安局反恐处",
    },
    {
        "id": "350902500000",
        "name": "福建省宁德市公安局蕉城分局巡特警反恐大队",
        "pid": "350900330000",
        "pname": "福建省宁德市公安局反恐怖支队",
    }, {
        "id": "350921500000",
        "name": "福建省霞浦县公安局巡特警反恐大队",
        "pid": "350900330000",
        "pname": "福建省宁德市公安局反恐怖支队",
    }, {
        "id": "350922500000",
        "name": "福建省古田县公安局巡特警反恐大队",
        "pid": "350900330000",
        "pname": "福建省宁德市公安局反恐怖支队",
    }, {
        "id": "350923500000",
        "name": "福建省屏南县巡特警反恐大队",
        "pid": "350900330000",
        "pname": "福建省宁德市公安局反恐怖支队",
    }, {
        "id": "350924500000",
        "name": "福建省寿宁县寿宁县公安局巡特警反恐大队",
        "pid": "350900330000",
        "pname": "福建省宁德市公安局反恐怖支队",
    }, {
        "id": "350925500000",
        "name": "福建省周宁县公安局巡特警反恐大队",
        "pid": "350900330000",
        "pname": "福建省宁德市公安局反恐怖支队",
    }, {
        "id": "350926280000",
        "name": "福建省柘荣县巡警特警反恐大队",
        "pid": "350900330000",
        "pname": "福建省宁德市公安局反恐怖支队",
    }, {
        "id": "350981500000",
        "name": "福建省福安市公安局巡特警反恐大队",
        "pid": "350900330000",
        "pname": "福建省宁德市公安局反恐怖支队",
    }, {
        "id": "350982500000",
        "name": "福建省福鼎市公安局巡特警反恐大队",
        "pid": "350900330000",
        "pname": "福建省宁德市公安局反恐怖支队",
    },
    {
        "id": "350999500000",
        "name": "福建省宁德市公安局东侨经济技术开发区分局巡特警反恐大队",
        "pid": "350900330000",
        "pname": "福建省宁德市公安局反恐怖支队",
    }, {
        "id": "351100T02700",
        "name": "福州铁路公安处反恐怖支队",
        "pid": "351100T00000",
        "pname": "福州铁路公安处",
    }, {
        "id": "351200T02700",
        "name": "厦门铁路公安处反恐怖支队",
        "pid": "351200T00000",
        "pname": "厦门铁路公安处",
    }
]

// 基础类数据

export const detailList = {
    // 学生群体
    studentList: [{
            label: '学校名称',
            type: 'text',
            key: 'xxmc',
            placeholder: '请输入学校名称'
        },
        {
            label: '所属地区',
            type: 'cascader',
            key: 'city',
            placeholder: '请选择所属地区',
            selectData: cityList
        },
        {
            label: '学校联系人',
            type: 'text',
            key: 'xxlxr',
            placeholder: '请输入学校联系人'
        },
        {
            label: '学校联系电话',
            type: 'text',
            key: 'xxlxdh',
            placeholder: '请输入学校联系电话'
        },
        {
            label: '所属地派出所民警',
            type: 'text',
            key: 'pcslxr',
            placeholder: '请输入民警姓名'
        },
        {
            label: '民警联系电话',
            type: 'text',
            key: 'pcslxrdh',
            placeholder: '请输入民警联系电话'
        },
        {
            label: '学校类别',
            type: 'select',
            key: 'xxlb',
            placeholder: '',
            selectData: [{
                    key: '小学',
                },
                {
                    key: '中学',
                },
                {
                    key: '中专',
                },
                {
                    key: '大学',
                },
                {
                    key: '大专',
                }
            ]
        },
        {
            label: '学校位置',
            type: 'adress',
            key: 'adress',
            placeholder: '',
            span: 12,
        },
        {
            label: '教师信息',
            type: 'table',
            key: 'jsxxList',
            placeholder: '',
            span: 24,
        },
        {
            label: '学址信息',
            type: 'text',
            key: 'addr',
            placeholder: '',
            span: 24,
        }
    ],
    // 烧烤店
    sktxxList: [{
        label: '烧烤店名称',
        type: 'text',
        key: 'sktxxMc',
        placeholder: '请输入烧烤店名称',
    }, {
        label: '营业执照',
        type: 'select',
        key: 'sktxxYwzz',
        placeholder: '请选择营业执照',
        selectData: [{
                key: '无',
            },
            {
                key: '有',
            },
        ]
    }, {
        label: '所属地区',
        type: 'cascader',
        key: 'sktxxDs',
        placeholder: '请选择所属地区',
        selectData: cityList,
    }, {
        label: '类型',
        type: 'select',
        key: 'sktxxLx',
        placeholder: '请选择烧烤店类型',
        selectData: [{
                key: '固定店面',
            },
            {
                key: '固定摊点',
            }, {
                key: '流动摊点',
            },
        ]

    }, {
        label: '店面地址',
        type: 'text',
        key: 'yl1',
        placeholder: '请输入烧烤店名称',
        selectData: [{
                key: '无',
            },
            {
                key: '有',
            },
        ]

    }, {
        label: '店面位置',
        type: 'adress',
        key: 'adress',
        placeholder: '请输入烧烤店名称',
        selectData: [{
                key: '无',
            },
            {
                key: '有',
            },
        ]

    }, {
        label: '开业时间',
        type: 'date',
        key: 'sktxxKysj',
        placeholder: '请选择开业时间',

    }, {
        label: '备注',
        type: 'textarea',
        key: 'sktxxBz',
        placeholder: '请选择开业时间',
        span: 24,
    }, ],
    //集体务工
    ifJtwgList: [{
            label: '务工企业名称',
            type: 'text',
            key: 'wgqymc',
            placeholder: '请输入务工企业名称',
        }, {
            label: '所属地区',
            type: 'cascader',
            key: 'city',
            placeholder: 'cityList',
            selectData: cityList,
        }, {
            label: '企业法人代表',
            type: 'text',
            key: 'kz1',
            placeholder: '请输入企业法人代表',
        }, {
            label: '联系电话',
            type: 'text',
            key: 'kz2',
            placeholder: '请输入企业法人代表联系电话',
        }, {
            label: '领队或联系人',
            type: 'text',
            key: 'lxr',
            placeholder: '请输入领队或联系人',
        }, {
            label: '联系电话',
            type: 'text',
            key: 'lxdh',
            placeholder: '请输入联系电话',
        }, {
            label: '原始身份',
            type: 'text',
            key: 'yssf',
            placeholder: '请输入原始身份',
        }, {
            label: '标签人员个数',
            type: 'input',
            key: 'bqry',
            placeholder: '请输入标签人员个数',
        }, {
            label: '人员民族成分',
            type: 'select',
            key: 'rymzcf',
            placeholder: '请选择人员民族',
            selectData: [],
            filterable: true,
        }, {
            label: '首批入厂时间',
            type: 'date',
            key: 'sprcsj',
            placeholder: '请输入标签人员个数',
        }, {
            label: '居住地址信息',
            type: 'text',
            key: 'addr',
            placeholder: '请输入要添加的地址',
            span: 24
        }, {
            label: '中介情况',
            type: 'textarea',
            key: 'zjqk',
            placeholder: '请输入要添加的地址',
            span: 24
        }, {
            label: '中介费收取方式',
            type: 'textarea',
            key: 'zjfsqfs',
            placeholder: '请输入要添加的地址',
            span: 24
        },

    ]

}

export const sjjgArr = [{
        dm: "350000",
        mc: "福建省"
    },
    {
        dm: "230000",
        mc: "黑龙江省"
    },
    {
        dm: "310000",
        mc: "上海市"
    },
    {
        dm: "320000",
        mc: "江苏省"
    },
    {
        dm: "110000",
        mc: "北京市"
    },
    {
        dm: "120000",
        mc: "天津市"
    },
    {
        dm: "130000",
        mc: "河北省"
    },
    {
        dm: "140000",
        mc: "山西省"
    },
    {
        dm: "150000",
        mc: "内蒙古自治区"
    },
    {
        dm: "210000",
        mc: "辽宁省"
    },
    {
        dm: "220000",
        mc: "吉林省"
    },
    {
        dm: "330000",
        mc: "浙江省"
    },
    {
        dm: "370000",
        mc: "山东省"
    },
    {
        dm: "410000",
        mc: "河南省"
    },
    {
        dm: "340000",
        mc: "安徽省"
    },
    {
        dm: "360000",
        mc: "江西省"
    },
    {
        dm: "460000",
        mc: "海南省"
    },
    {
        dm: "500000",
        mc: "重庆市"
    },
    {
        dm: "510000",
        mc: "四川省"
    },
    {
        dm: "420000",
        mc: "湖北省"
    },
    {
        dm: "430000",
        mc: "湖南省"
    },
    {
        dm: "440000",
        mc: "广东省"
    },
    {
        dm: "450000",
        mc: "广西壮族自治区"
    },
    {
        dm: "520000",
        mc: "贵州省"
    },
    {
        dm: "530000",
        mc: "云南省"
    },
    {
        dm: "630000",
        mc: "青海省"
    },
    {
        dm: "640000",
        mc: "宁夏回族自治区"
    },
    {
        dm: "650000",
        mc: "新疆维吾尔自治区"
    },
    {
        dm: "540000",
        mc: "西藏自治区"
    },
    {
        dm: "610000",
        mc: "陕西省"
    },
    {
        dm: "620000",
        mc: "甘肃省"
    },
    {
        dm: "710000",
        mc: "台湾省"
    },
    {
        dm: "810000",
        mc: "香港特别行政区"
    },
    {
        dm: "820000",
        mc: "澳门特别行政区"
    }

];

export const dsjgArr1 = [{
        fdm: "22",
        dm: "220300",
        mc: "四平市"
    },
    {
        fdm: "22",
        dm: "220400",
        mc: "辽源市"
    },
    {
        fdm: "22",
        dm: "220500",
        mc: "通化市"
    },
    {
        fdm: "22",
        dm: "220600",
        mc: "白山市"
    },
    {
        fdm: "22",
        dm: "220700",
        mc: "松原市"
    },
    {
        fdm: "22",
        dm: "220800",
        mc: "白城市"
    },
    {
        fdm: "22",
        dm: "222400",
        mc: "延边朝鲜族自治州"
    },
    {
        fdm: "23",
        dm: "230100",
        mc: "哈尔滨市"
    },
    {
        fdm: "23",
        dm: "230200",
        mc: "齐齐哈尔市"
    },
    {
        fdm: "23",
        dm: "230300",
        mc: "鸡西市"
    },
    {
        fdm: "23",
        dm: "230400",
        mc: "鹤岗市"
    },
    {
        fdm: "23",
        dm: "230500",
        mc: "双鸭山市"
    },
    {
        fdm: "23",
        dm: "230600",
        mc: "大庆市"
    },
    {
        fdm: "23",
        dm: "230700",
        mc: "伊春市"
    },
    {
        fdm: "23",
        dm: "230800",
        mc: "佳木斯市"
    },
    {
        fdm: "23",
        dm: "230900",
        mc: "七台河市"
    },
    {
        fdm: "23",
        dm: "231000",
        mc: "牡丹江市"
    },
    {
        fdm: "23",
        dm: "231100",
        mc: "黑河市"
    },
    {
        fdm: "23",
        dm: "231200",
        mc: "绥化市"
    },
    {
        fdm: "23",
        dm: "232700",
        mc: "大兴安岭地区"
    },
    {
        fdm: "31",
        dm: "310100",
        mc: "市辖区"
    },
    {
        fdm: "32",
        dm: "320100",
        mc: "南京市"
    },
    {
        fdm: "11",
        dm: "110100",
        mc: "市辖区"
    },
    {
        fdm: "12",
        dm: "120100",
        mc: "市辖区"
    },
    {
        fdm: "13",
        dm: "130100",
        mc: "石家庄市"
    },
    {
        fdm: "13",
        dm: "130200",
        mc: "唐山市"
    },
    {
        fdm: "13",
        dm: "130300",
        mc: "秦皇岛市"
    },
    {
        fdm: "13",
        dm: "130400",
        mc: "邯郸市"
    },
    {
        fdm: "13",
        dm: "130500",
        mc: "邢台市"
    },
    {
        fdm: "13",
        dm: "130600",
        mc: "保定市"
    },
    {
        fdm: "13",
        dm: "130700",
        mc: "张家口市"
    },
    {
        fdm: "13",
        dm: "130800",
        mc: "承德市"
    },
    {
        fdm: "13",
        dm: "130900",
        mc: "沧州市"
    },
    {
        fdm: "13",
        dm: "131000",
        mc: "廊坊市"
    },
    {
        fdm: "13",
        dm: "131100",
        mc: "衡水市"
    },
    {
        fdm: "14",
        dm: "140100",
        mc: "太原市"
    },
    {
        fdm: "14",
        dm: "140200",
        mc: "大同市"
    },
    {
        fdm: "14",
        dm: "140300",
        mc: "阳泉市"
    },
    {
        fdm: "14",
        dm: "140400",
        mc: "长治市"
    },
    {
        fdm: "14",
        dm: "140500",
        mc: "晋城市"
    },
    {
        fdm: "14",
        dm: "140600",
        mc: "朔州市"
    },
    {
        fdm: "14",
        dm: "140700",
        mc: "晋中市"
    },
    {
        fdm: "14",
        dm: "140800",
        mc: "运城市"
    },
    {
        fdm: "14",
        dm: "140900",
        mc: "忻州市"
    },
    {
        fdm: "14",
        dm: "141000",
        mc: "临汾市"
    },
    {
        fdm: "14",
        dm: "141100",
        mc: "吕梁市"
    },
    {
        fdm: "15",
        dm: "150100",
        mc: "呼和浩特市"
    },
    {
        fdm: "15",
        dm: "150200",
        mc: "包头市"
    },
    {
        fdm: "15",
        dm: "150300",
        mc: "乌海市"
    },
    {
        fdm: "15",
        dm: "150400",
        mc: "赤峰市"
    },
    {
        fdm: "15",
        dm: "150500",
        mc: "通辽市"
    },
    {
        fdm: "15",
        dm: "150600",
        mc: "鄂尔多斯市"
    },
    {
        fdm: "15",
        dm: "150700",
        mc: "呼伦贝尔市"
    },
    {
        fdm: "15",
        dm: "150800",
        mc: "巴彦淖尔市"
    },
    {
        fdm: "15",
        dm: "150900",
        mc: "乌兰察布市"
    },
    {
        fdm: "15",
        dm: "152200",
        mc: "兴安盟"
    },
    {
        fdm: "15",
        dm: "152500",
        mc: "锡林郭勒盟"
    },
    {
        fdm: "15",
        dm: "152600",
        mc: "乌兰察布盟"
    },
    {
        fdm: "15",
        dm: "152900",
        mc: "阿拉善盟"
    },
    {
        fdm: "21",
        dm: "210100",
        mc: "沈阳市"
    },
    {
        fdm: "21",
        dm: "210200",
        mc: "大连市"
    },
    {
        fdm: "21",
        dm: "210300",
        mc: "鞍山市"
    },
    {
        fdm: "21",
        dm: "210400",
        mc: "抚顺市"
    },
    {
        fdm: "21",
        dm: "210500",
        mc: "本溪市"
    },
    {
        fdm: "21",
        dm: "210600",
        mc: "丹东市"
    },
    {
        fdm: "21",
        dm: "210700",
        mc: "锦州市"
    },
    {
        fdm: "21",
        dm: "210800",
        mc: "营口市"
    },
    {
        fdm: "21",
        dm: "210900",
        mc: "阜新市"
    },
    {
        fdm: "21",
        dm: "211000",
        mc: "辽阳市"
    },
    {
        fdm: "21",
        dm: "211100",
        mc: "盘锦市"
    },
    {
        fdm: "21",
        dm: "211200",
        mc: "铁岭市"
    },
    {
        fdm: "21",
        dm: "211300",
        mc: "朝阳市"
    },
    {
        fdm: "21",
        dm: "211400",
        mc: "葫芦岛市"
    },
    {
        fdm: "22",
        dm: "220100",
        mc: "长春市"
    },
    {
        fdm: "22",
        dm: "220200",
        mc: "吉林市"
    },
    {
        fdm: "32",
        dm: "320200",
        mc: "无锡市"
    },
    {
        fdm: "32",
        dm: "320300",
        mc: "徐州市"
    },
    {
        fdm: "32",
        dm: "320400",
        mc: "常州市"
    },
    {
        fdm: "32",
        dm: "320500",
        mc: "苏州市"
    },
    {
        fdm: "32",
        dm: "320600",
        mc: "南通市"
    },
    {
        fdm: "32",
        dm: "320700",
        mc: "云港市"
    },
    {
        fdm: "32",
        dm: "320800",
        mc: "淮安市"
    },
    {
        fdm: "32",
        dm: "320900",
        mc: "盐城市"
    },
    {
        fdm: "32",
        dm: "321000",
        mc: "扬州市"
    },
    {
        fdm: "32",
        dm: "321100",
        mc: "镇江市"
    },
    {
        fdm: "32",
        dm: "321200",
        mc: "泰州市"
    },
    {
        fdm: "32",
        dm: "321300",
        mc: "宿迁市"
    },
    {
        fdm: "33",
        dm: "330100",
        mc: "杭州市"
    },
    {
        fdm: "33",
        dm: "330200",
        mc: "宁波市"
    },
    {
        fdm: "33",
        dm: "330300",
        mc: "温州市"
    },
    {
        fdm: "33",
        dm: "330400",
        mc: "嘉兴市"
    },
    {
        fdm: "33",
        dm: "330500",
        mc: "湖州市"
    },
    {
        fdm: "33",
        dm: "330600",
        mc: "绍兴市"
    },
    {
        fdm: "33",
        dm: "330700",
        mc: "金华市"
    },
    {
        fdm: "33",
        dm: "330800",
        mc: "衢州市"
    },
    {
        fdm: "33",
        dm: "330900",
        mc: "舟山市"
    },
    {
        fdm: "33",
        dm: "331000",
        mc: "台州市"
    },
    {
        fdm: "33",
        dm: "331100",
        mc: "丽水市"
    },
    {
        fdm: "37",
        dm: "370100",
        mc: "济南市"
    },
    {
        fdm: "37",
        dm: "370200",
        mc: "青岛市"
    },
    {
        fdm: "37",
        dm: "370300",
        mc: "淄博市"
    },
    {
        fdm: "37",
        dm: "370400",
        mc: "枣庄市"
    },
    {
        fdm: "37",
        dm: "370500",
        mc: "东营市"
    },
    {
        fdm: "37",
        dm: "370600",
        mc: "烟台市"
    },
    {
        fdm: "37",
        dm: "370700",
        mc: "潍坊市"
    },
    {
        fdm: "37",
        dm: "370800",
        mc: "济宁市"
    },
    {
        fdm: "37",
        dm: "370900",
        mc: "泰安市"
    },
    {
        fdm: "37",
        dm: "371000",
        mc: "威海市"
    },
    {
        fdm: "37",
        dm: "371100",
        mc: "省日照市"
    },
    {
        fdm: "37",
        dm: "371200",
        mc: "莱芜市"
    },
    {
        fdm: "37",
        dm: "371300",
        mc: "临沂市"
    },
    {
        fdm: "37",
        dm: "371400",
        mc: "德州市"
    },
    {
        fdm: "37",
        dm: "371500",
        mc: "聊城市"
    },
    {
        fdm: "37",
        dm: "371600",
        mc: "滨州市"
    },
    {
        fdm: "37",
        dm: "371700",
        mc: "菏泽市"
    },
    {
        fdm: "37",
        dm: "372100",
        mc: "齐鲁石化公司"
    },
    {
        fdm: "37",
        dm: "372200",
        mc: "煤炭管理局"
    },
    {
        fdm: "37",
        dm: "373000",
        mc: "胜利油田"
    },
    {
        fdm: "41",
        dm: "410100",
        mc: "郑州市"
    },
    {
        fdm: "41",
        dm: "410200",
        mc: "开封市"
    },
    {
        fdm: "34",
        dm: "340100",
        mc: "合肥市"
    },
    {
        fdm: "34",
        dm: "340200",
        mc: "芜湖市"
    },
    {
        fdm: "34",
        dm: "340300",
        mc: "蚌埠市"
    },
    {
        fdm: "34",
        dm: "340400",
        mc: "淮南市"
    },
    {
        fdm: "34",
        dm: "340500",
        mc: "马鞍山市"
    },
    {
        fdm: "34",
        dm: "340600",
        mc: "淮北市"
    },
    {
        fdm: "34",
        dm: "340700",
        mc: "铜陵市"
    },
    {
        fdm: "34",
        dm: "340800",
        mc: "安庆市"
    },
    {
        fdm: "34",
        dm: "341000",
        mc: "黄山市"
    },
    {
        fdm: "34",
        dm: "341100",
        mc: "滁州市"
    },
    {
        fdm: "34",
        dm: "341200",
        mc: "阜阳市"
    },
    {
        fdm: "34",
        dm: "341300",
        mc: "宿州市"
    },
    {
        fdm: "34",
        dm: "341400",
        mc: "巢湖市"
    },
    {
        fdm: "34",
        dm: "341500",
        mc: "六安市"
    },
    {
        fdm: "34",
        dm: "341600",
        mc: "亳州市"
    },
    {
        fdm: "34",
        dm: "341700",
        mc: "池州市"
    },
    {
        fdm: "34",
        dm: "341800",
        mc: "宣城市"
    },
    {
        fdm: "35",
        dm: "350100",
        mc: "福州市"
    },
    {
        fdm: "35",
        dm: "350200",
        mc: "厦门市"
    },
    {
        fdm: "35",
        dm: "350300",
        mc: "莆田市"
    },
    {
        fdm: "35",
        dm: "350400",
        mc: "三明市"
    },
    {
        fdm: "35",
        dm: "350500",
        mc: "泉州市"
    },
    {
        fdm: "35",
        dm: "350600",
        mc: "漳州市"
    },
    {
        fdm: "35",
        dm: "350700",
        mc: "南平市"
    },
    {
        fdm: "35",
        dm: "350800",
        mc: "龙岩市"
    },
    {
        fdm: "35",
        dm: "350900",
        mc: "宁德市"
    },
    {
        fdm: "36",
        dm: "360100",
        mc: "南昌市"
    },
    {
        fdm: "36",
        dm: "360200",
        mc: "景德镇市"
    },
    {
        fdm: "36",
        dm: "360300",
        mc: "萍乡市"
    },
    {
        fdm: "36",
        dm: "360400",
        mc: "九江市"
    },
    {
        fdm: "36",
        dm: "360500",
        mc: "新余市"
    },
    {
        fdm: "36",
        dm: "360600",
        mc: "鹰潭市"
    },
    {
        fdm: "36",
        dm: "360700",
        mc: "赣州市"
    },
    {
        fdm: "36",
        dm: "360800",
        mc: "吉安市"
    },
    {
        fdm: "36",
        dm: "360900",
        mc: "宜春市"
    },
    {
        fdm: "36",
        dm: "361000",
        mc: "抚州市"
    },
    {
        fdm: "36",
        dm: "361100",
        mc: "上饶市"
    },
    {
        fdm: "45",
        dm: "451200",
        mc: "河池市"
    },
    {
        fdm: "45",
        dm: "451300",
        mc: "来宾市"
    },
    {
        fdm: "45",
        dm: "451400",
        mc: "崇左市"
    },
    {
        fdm: "46",
        dm: "460100",
        mc: "海口市"
    },
    {
        fdm: "46",
        dm: "460200",
        mc: "三亚市"
    },
    {
        fdm: "46",
        dm: "469000",
        mc: "省直辖县级行政单位"
    },
    {
        fdm: "50",
        dm: "500100",
        mc: "市辖区"
    },
    {
        fdm: "50",
        dm: "500200",
        mc: "重庆市县"
    },
    {
        fdm: "50",
        dm: "500300",
        mc: "重庆市市"
    },
    {
        fdm: "51",
        dm: "510100",
        mc: "成都市"
    },
    {
        fdm: "51",
        dm: "510300",
        mc: "自贡市"
    },
    {
        fdm: "51",
        dm: "510400",
        mc: "攀枝花市"
    },
    {
        fdm: "51",
        dm: "510500",
        mc: "泸州市"
    },
    {
        fdm: "51",
        dm: "510600",
        mc: "德阳市"
    },
    {
        fdm: "51",
        dm: "510700",
        mc: "绵阳市"
    },
    {
        fdm: "51",
        dm: "510800",
        mc: "广元市"
    },
    {
        fdm: "51",
        dm: "510900",
        mc: "遂宁市"
    },
    {
        fdm: "51",
        dm: "511000",
        mc: "内江市"
    },
    {
        fdm: "51",
        dm: "511100",
        mc: "乐山市"
    },
    {
        fdm: "51",
        dm: "511300",
        mc: "南充市"
    },
    {
        fdm: "51",
        dm: "511400",
        mc: "眉山市"
    },
    {
        fdm: "51",
        dm: "511500",
        mc: "宜宾市"
    },
    {
        fdm: "41",
        dm: "410300",
        mc: "洛阳市"
    },
    {
        fdm: "41",
        dm: "410400",
        mc: "平顶山市"
    },
    {
        fdm: "41",
        dm: "410500",
        mc: "安阳市"
    },
    {
        fdm: "41",
        dm: "410600",
        mc: "鹤壁市"
    },
    {
        fdm: "41",
        dm: "410700",
        mc: "新乡市"
    },
    {
        fdm: "41",
        dm: "410800",
        mc: "焦作市"
    },
    {
        fdm: "41",
        dm: "410900",
        mc: "濮阳市"
    },
    {
        fdm: "41",
        dm: "411000",
        mc: "许昌市"
    },
    {
        fdm: "41",
        dm: "411100",
        mc: "漯河市"
    },
    {
        fdm: "41",
        dm: "411200",
        mc: "三门峡市"
    },
    {
        fdm: "41",
        dm: "411300",
        mc: "南阳市"
    },
    {
        fdm: "41",
        dm: "411400",
        mc: "商丘市"
    },
    {
        fdm: "41",
        dm: "411500",
        mc: "信阳市"
    },
    {
        fdm: "41",
        dm: "411600",
        mc: "周口市"
    },
    {
        fdm: "41",
        dm: "411700",
        mc: "驻马店市"
    },
    {
        fdm: "42",
        dm: "420100",
        mc: "武汉市"
    },
    {
        fdm: "42",
        dm: "420200",
        mc: "黄石市"
    },
    {
        fdm: "42",
        dm: "420300",
        mc: "十堰市"
    },
    {
        fdm: "42",
        dm: "420500",
        mc: "宜昌市"
    },
    {
        fdm: "42",
        dm: "420600",
        mc: "襄樊市"
    },
    {
        fdm: "42",
        dm: "420700",
        mc: "鄂州市"
    },
    {
        fdm: "42",
        dm: "420800",
        mc: "荆门市"
    },
    {
        fdm: "42",
        dm: "420900",
        mc: "孝感市"
    },
    {
        fdm: "42",
        dm: "421000",
        mc: "荆州市"
    },
    {
        fdm: "42",
        dm: "421100",
        mc: "黄冈市"
    },
    {
        fdm: "42",
        dm: "421200",
        mc: "咸宁市"
    },
    {
        fdm: "42",
        dm: "421300",
        mc: "随州市"
    },
    {
        fdm: "42",
        dm: "422800",
        mc: "恩施土家族苗族自治州"
    },
    {
        fdm: "42",
        dm: "429000",
        mc: "省直辖行政单位"
    },
    {
        fdm: "43",
        dm: "430100",
        mc: "长沙市"
    },
    {
        fdm: "43",
        dm: "430200",
        mc: "株洲市"
    },
    {
        fdm: "43",
        dm: "430300",
        mc: "湘潭市"
    },
    {
        fdm: "43",
        dm: "430400",
        mc: "衡阳市"
    },
    {
        fdm: "43",
        dm: "430500",
        mc: "邵阳市"
    },
    {
        fdm: "43",
        dm: "430600",
        mc: "岳阳市"
    },
    {
        fdm: "43",
        dm: "430700",
        mc: "常德市"
    },
    {
        fdm: "43",
        dm: "430800",
        mc: "张家界市"
    },
    {
        fdm: "43",
        dm: "430900",
        mc: "益阳市"
    },
    {
        fdm: "43",
        dm: "431000",
        mc: "郴州市"
    },
    {
        fdm: "43",
        dm: "431100",
        mc: "永州市"
    },
    {
        fdm: "43",
        dm: "431200",
        mc: "怀化市"
    },
    {
        fdm: "43",
        dm: "431300",
        mc: "娄底市"
    },
    {
        fdm: "43",
        dm: "433100",
        mc: "湘西土家族苗族自治州"
    },
    {
        fdm: "44",
        dm: "440100",
        mc: "广州市"
    },
    {
        fdm: "44",
        dm: "440200",
        mc: "韶关市"
    },
    {
        fdm: "44",
        dm: "440300",
        mc: "深圳市"
    },
    {
        fdm: "44",
        dm: "440400",
        mc: "珠海市"
    },
    {
        fdm: "44",
        dm: "440500",
        mc: "汕头市"
    },
    {
        fdm: "44",
        dm: "440600",
        mc: "佛山市"
    },
    {
        fdm: "44",
        dm: "440700",
        mc: "江门市"
    },
    {
        fdm: "44",
        dm: "440800",
        mc: "湛江市"
    },
    {
        fdm: "44",
        dm: "440900",
        mc: "茂名市"
    },
    {
        fdm: "44",
        dm: "441200",
        mc: "肇庆市"
    },
    {
        fdm: "44",
        dm: "441300",
        mc: "惠州市"
    },
    {
        fdm: "44",
        dm: "441400",
        mc: "梅州市"
    },
    {
        fdm: "44",
        dm: "441500",
        mc: "汕尾市"
    },
    {
        fdm: "44",
        dm: "441600",
        mc: "河源市"
    },
    {
        fdm: "44",
        dm: "441700",
        mc: "阳江市"
    },
    {
        fdm: "44",
        dm: "441800",
        mc: "清远市"
    },
    {
        fdm: "44",
        dm: "441900",
        mc: "东莞市"
    },
    {
        fdm: "44",
        dm: "442000",
        mc: "中山市"
    },
    {
        fdm: "44",
        dm: "445100",
        mc: "潮州市"
    },
    {
        fdm: "44",
        dm: "445200",
        mc: "揭阳市"
    },
    {
        fdm: "44",
        dm: "445300",
        mc: "云浮市"
    },
    {
        fdm: "45",
        dm: "450100",
        mc: "南宁市"
    },
    {
        fdm: "45",
        dm: "450200",
        mc: "柳州市"
    },
    {
        fdm: "45",
        dm: "450300",
        mc: "桂林市"
    },
    {
        fdm: "45",
        dm: "450400",
        mc: "梧州市"
    },
    {
        fdm: "45",
        dm: "450500",
        mc: "北海市"
    },
    {
        fdm: "45",
        dm: "450600",
        mc: "防城港市"
    },
    {
        fdm: "45",
        dm: "450700",
        mc: "钦州市"
    },
    {
        fdm: "45",
        dm: "450800",
        mc: "贵港市"
    },
    {
        fdm: "45",
        dm: "450900",
        mc: "玉林市"
    },
    {
        fdm: "45",
        dm: "451000",
        mc: "百色市"
    },
    {
        fdm: "45",
        dm: "451100",
        mc: "贺州市"
    },
    {
        fdm: "51",
        dm: "511600",
        mc: "广安市"
    },
    {
        fdm: "51",
        dm: "511700",
        mc: "达州市"
    },
    {
        fdm: "51",
        dm: "511800",
        mc: "雅安市"
    },
    {
        fdm: "51",
        dm: "511900",
        mc: "巴中市"
    },
    {
        fdm: "51",
        dm: "512000",
        mc: "资阳市"
    },
    {
        fdm: "51",
        dm: "513200",
        mc: "阿坝藏族羌族自治州"
    },
    {
        fdm: "51",
        dm: "513300",
        mc: "甘孜藏族自治州"
    },
    {
        fdm: "51",
        dm: "513400",
        mc: "凉山彝族自治州"
    },
    {
        fdm: "52",
        dm: "520100",
        mc: "贵阳市"
    },
    {
        fdm: "52",
        dm: "520200",
        mc: "六盘水市"
    },
    {
        fdm: "52",
        dm: "520300",
        mc: "遵义市"
    },
    {
        fdm: "52",
        dm: "520400",
        mc: "安顺市"
    },
    {
        fdm: "52",
        dm: "522200",
        mc: "铜仁地区"
    },
    {
        fdm: "52",
        dm: "522300",
        mc: "黔西南布依族苗族自治州"
    },
    {
        fdm: "52",
        dm: "522400",
        mc: "毕节地区"
    },
    {
        fdm: "52",
        dm: "522600",
        mc: "黔东南苗族侗族自治州"
    },
    {
        fdm: "52",
        dm: "522700",
        mc: "黔南布依族苗族自治州"
    },
    {
        fdm: "53",
        dm: "530100",
        mc: "昆明市"
    },
    {
        fdm: "53",
        dm: "530300",
        mc: "曲靖市"
    },
    {
        fdm: "53",
        dm: "530400",
        mc: "玉溪市"
    },
    {
        fdm: "53",
        dm: "530500",
        mc: "保山市"
    },
    {
        fdm: "62",
        dm: "620700",
        mc: "张掖市"
    },
    {
        fdm: "62",
        dm: "620800",
        mc: "平凉市"
    },
    {
        fdm: "62",
        dm: "620900",
        mc: "酒泉市"
    },
    {
        fdm: "62",
        dm: "621000",
        mc: "庆阳市"
    },
    {
        fdm: "62",
        dm: "621100",
        mc: "定西市"
    },
    {
        fdm: "62",
        dm: "621200",
        mc: "陇南市"
    },
    {
        fdm: "62",
        dm: "622900",
        mc: "临夏回族自治州"
    },
    {
        fdm: "62",
        dm: "623000",
        mc: "甘南藏族自治州"
    },
    {
        fdm: "63",
        dm: "630100",
        mc: "西宁市"
    },
    {
        fdm: "63",
        dm: "632100",
        mc: "海东地区"
    },
    {
        fdm: "63",
        dm: "632200",
        mc: "海北藏族自治州"
    },
    {
        fdm: "63",
        dm: "632300",
        mc: "黄南藏族自治州"
    },
    {
        fdm: "63",
        dm: "632500",
        mc: "海南藏族自治州"
    },
    {
        fdm: "63",
        dm: "632600",
        mc: "果洛藏族自治州"
    },
    {
        fdm: "63",
        dm: "632700",
        mc: "玉树藏族自治州"
    },
    {
        fdm: "63",
        dm: "632800",
        mc: "海西蒙古族藏族自治州"
    },
    {
        fdm: "64",
        dm: "640100",
        mc: "银川市"
    },
    {
        fdm: "64",
        dm: "640200",
        mc: "石嘴山市"
    },
    {
        fdm: "64",
        dm: "640300",
        mc: "吴忠市"
    },
    {
        fdm: "64",
        dm: "640400",
        mc: "固原市"
    },
    {
        fdm: "64",
        dm: "640500",
        mc: "中卫市"
    },
    {
        fdm: "65",
        dm: "650100",
        mc: "乌鲁木齐市"
    },
    {
        fdm: "65",
        dm: "650200",
        mc: "克拉玛依市"
    },
    {
        fdm: "65",
        dm: "652100",
        mc: "吐鲁番地区"
    },
    {
        fdm: "65",
        dm: "650402",
        mc: "吐鲁番市高昌区"
    },
    {
        fdm: "65",
        dm: "650421",
        mc: "吐鲁番市鄯善县"
    },
    {
        fdm: "65",
        dm: "650422",
        mc: "吐鲁番市托克逊县"
    },
    // {
    //     fdm: "65",
    //     dm: "650402",
    //     mc: "吐鲁番市高昌区"
    // },
    {
        fdm: "65",
        dm: "652200",
        mc: "哈密地区"
    },
    {
        fdm: "65",
        dm: "652300",
        mc: "昌吉回族自治州"
    },
    {
        fdm: "65",
        dm: "652700",
        mc: "博尔塔拉蒙古自治州"
    },
    {
        fdm: "65",
        dm: "652800",
        mc: "巴音郭楞蒙古自治州"
    },
    {
        fdm: "65",
        dm: "652900",
        mc: "阿克苏地区"
    },
    {
        fdm: "65",
        dm: "653000",
        mc: "克孜勒苏柯尔克孜自治州"
    },
    {
        fdm: "65",
        dm: "653100",
        mc: "喀什地区"
    },
    {
        fdm: "53",
        dm: "530600",
        mc: "昭通市"
    },
    {
        fdm: "53",
        dm: "530700",
        mc: "丽江市"
    },
    {
        fdm: "53",
        dm: "530800",
        mc: "思茅市"
    },
    {
        fdm: "53",
        dm: "530900",
        mc: "临沧市"
    },
    {
        fdm: "53",
        dm: "532300",
        mc: "楚雄彝族自治州"
    },
    {
        fdm: "53",
        dm: "532500",
        mc: "红河哈尼族彝族自治州"
    },
    {
        fdm: "53",
        dm: "532600",
        mc: "文山壮族苗族自治州"
    },
    {
        fdm: "53",
        dm: "532800",
        mc: "西双版纳傣族自治州"
    },
    {
        fdm: "53",
        dm: "532900",
        mc: "大理白族自治州"
    },
    {
        fdm: "53",
        dm: "533100",
        mc: "德宏傣族景颇族自治州"
    },
    {
        fdm: "53",
        dm: "533300",
        mc: "怒江傈僳族自治州"
    },
    {
        fdm: "53",
        dm: "533400",
        mc: "迪庆藏族自治州"
    },
    {
        fdm: "54",
        dm: "540100",
        mc: "拉萨市"
    },
    {
        fdm: "54",
        dm: "542100",
        mc: "昌都地区"
    },
    {
        fdm: "54",
        dm: "542200",
        mc: "山南地区"
    },
    {
        fdm: "54",
        dm: "542300",
        mc: "日喀则地区"
    },
    {
        fdm: "54",
        dm: "542400",
        mc: "那曲地区"
    },
    {
        fdm: "54",
        dm: "542500",
        mc: "阿里地区"
    },
    {
        fdm: "54",
        dm: "542600",
        mc: "林芝地区"
    },
    {
        fdm: "61",
        dm: "610100",
        mc: "西安市"
    },
    {
        fdm: "61",
        dm: "610200",
        mc: "铜川市"
    },
    {
        fdm: "61",
        dm: "610300",
        mc: "宝鸡市"
    },
    {
        fdm: "61",
        dm: "610400",
        mc: "咸阳市"
    },
    {
        fdm: "61",
        dm: "610500",
        mc: "渭南市"
    },
    {
        fdm: "61",
        dm: "610600",
        mc: "延安市"
    },
    {
        fdm: "61",
        dm: "610700",
        mc: "汉中市"
    },
    {
        fdm: "61",
        dm: "610800",
        mc: "榆林市"
    },
    {
        fdm: "61",
        dm: "610900",
        mc: "安康市"
    },
    {
        fdm: "61",
        dm: "611000",
        mc: "商洛市"
    },
    {
        fdm: "62",
        dm: "620100",
        mc: "兰州市"
    },
    {
        fdm: "62",
        dm: "620200",
        mc: "嘉峪关市"
    },
    {
        fdm: "62",
        dm: "620300",
        mc: "金昌市"
    },
    {
        fdm: "62",
        dm: "620400",
        mc: "白银市"
    },
    {
        fdm: "62",
        dm: "620500",
        mc: "天水市"
    },
    {
        fdm: "62",
        dm: "620600",
        mc: "武威市"
    },
    {
        fdm: "65",
        dm: "653200",
        mc: "和田地区"
    },
    {
        fdm: "65",
        dm: "654000",
        mc: "伊犁哈萨克自治州"
    },
    {
        fdm: "65",
        dm: "654200",
        mc: "塔城地区"
    },
    {
        fdm: "65",
        dm: "654300",
        mc: "阿勒泰地区"
    },
    {
        fdm: "65",
        dm: "659000",
        mc: "省直辖行政单位"
    }

]

export const allCityName = [{
        "dm": "350000",
        "mc": "福建省",
        "children": [{
            "fdm": "35",
            "dm": "350100",
            "mc": "福州市"
        }, {
            "fdm": "35",
            "dm": "350200",
            "mc": "厦门市"
        }, {
            "fdm": "35",
            "dm": "350300",
            "mc": "莆田市"
        }, {
            "fdm": "35",
            "dm": "350400",
            "mc": "三明市"
        }, {
            "fdm": "35",
            "dm": "350500",
            "mc": "泉州市"
        }, {
            "fdm": "35",
            "dm": "350600",
            "mc": "漳州市"
        }, {
            "fdm": "35",
            "dm": "350700",
            "mc": "南平市"
        }, {
            "fdm": "35",
            "dm": "350800",
            "mc": "龙岩市"
        }, {
            "fdm": "35",
            "dm": "350900",
            "mc": "宁德市"
        }]
    },
    {
        "dm": "230000",
        "mc": "黑龙江省",
        "children": [{
            "fdm": "23",
            "dm": "230100",
            "mc": "哈尔滨市"
        }, {
            "fdm": "23",
            "dm": "230200",
            "mc": "齐齐哈尔市"
        }, {
            "fdm": "23",
            "dm": "230300",
            "mc": "鸡西市"
        }, {
            "fdm": "23",
            "dm": "230400",
            "mc": "鹤岗市"
        }, {
            "fdm": "23",
            "dm": "230500",
            "mc": "双鸭山市"
        }, {
            "fdm": "23",
            "dm": "230600",
            "mc": "大庆市"
        }, {
            "fdm": "23",
            "dm": "230700",
            "mc": "伊春市"
        }, {
            "fdm": "23",
            "dm": "230800",
            "mc": "佳木斯市"
        }, {
            "fdm": "23",
            "dm": "230900",
            "mc": "七台河市"
        }, {
            "fdm": "23",
            "dm": "231000",
            "mc": "牡丹江市"
        }, {
            "fdm": "23",
            "dm": "231100",
            "mc": "黑河市"
        }, {
            "fdm": "23",
            "dm": "231200",
            "mc": "绥化市"
        }, {
            "fdm": "23",
            "dm": "232700",
            "mc": "大兴安岭地区"
        }]
    },
    {
        "dm": "310000",
        "mc": "上海市",
        "children": [{
            "fdm": "31",
            "dm": "310100",
            "mc": "市辖区"
        }]
    },
    {
        "dm": "320000",
        "mc": "江苏省",
        "children": [{
            "fdm": "32",
            "dm": "320100",
            "mc": "南京市"
        }, {
            "fdm": "32",
            "dm": "320200",
            "mc": "无锡市"
        }, {
            "fdm": "32",
            "dm": "320300",
            "mc": "徐州市"
        }, {
            "fdm": "32",
            "dm": "320400",
            "mc": "常州市"
        }, {
            "fdm": "32",
            "dm": "320500",
            "mc": "苏州市"
        }, {
            "fdm": "32",
            "dm": "320600",
            "mc": "南通市"
        }, {
            "fdm": "32",
            "dm": "320700",
            "mc": "云港市"
        }, {
            "fdm": "32",
            "dm": "320800",
            "mc": "淮安市"
        }, {
            "fdm": "32",
            "dm": "320900",
            "mc": "盐城市"
        }, {
            "fdm": "32",
            "dm": "321000",
            "mc": "扬州市"
        }, {
            "fdm": "32",
            "dm": "321100",
            "mc": "镇江市"
        }, {
            "fdm": "32",
            "dm": "321200",
            "mc": "泰州市"
        }, {
            "fdm": "32",
            "dm": "321300",
            "mc": "宿迁市"
        }]
    },
    {
        "dm": "110000",
        "mc": "北京市",
        "children": [{
            "fdm": "11",
            "dm": "110100",
            "mc": "市辖区"
        }]
    }, {
        "dm": "120000",
        "mc": "天津市",
        "children": [{
            "fdm": "12",
            "dm": "120100",
            "mc": "市辖区"
        }]
    },
    {
        "dm": "130000",
        "mc": "河北省",
        "children": [{
            "fdm": "13",
            "dm": "130100",
            "mc": "石家庄市"
        }, {
            "fdm": "13",
            "dm": "130200",
            "mc": "唐山市"
        }, {
            "fdm": "13",
            "dm": "130300",
            "mc": "秦皇岛市"
        }, {
            "fdm": "13",
            "dm": "130400",
            "mc": "邯郸市"
        }, {
            "fdm": "13",
            "dm": "130500",
            "mc": "邢台市"
        }, {
            "fdm": "13",
            "dm": "130600",
            "mc": "保定市"
        }, {
            "fdm": "13",
            "dm": "130700",
            "mc": "张家口市"
        }, {
            "fdm": "13",
            "dm": "130800",
            "mc": "承德市"
        }, {
            "fdm": "13",
            "dm": "130900",
            "mc": "沧州市"
        }, {
            "fdm": "13",
            "dm": "131000",
            "mc": "廊坊市"
        }, {
            "fdm": "13",
            "dm": "131100",
            "mc": "衡水市"
        }]
    }, {
        "dm": "140000",
        "mc": "山西省",
        "children": [{
            "fdm": "14",
            "dm": "140100",
            "mc": "太原市"
        }, {
            "fdm": "14",
            "dm": "140200",
            "mc": "大同市"
        }, {
            "fdm": "14",
            "dm": "140300",
            "mc": "阳泉市"
        }, {
            "fdm": "14",
            "dm": "140400",
            "mc": "长治市"
        }, {
            "fdm": "14",
            "dm": "140500",
            "mc": "晋城市"
        }, {
            "fdm": "14",
            "dm": "140600",
            "mc": "朔州市"
        }, {
            "fdm": "14",
            "dm": "140700",
            "mc": "晋中市"
        }, {
            "fdm": "14",
            "dm": "140800",
            "mc": "运城市"
        }, {
            "fdm": "14",
            "dm": "140900",
            "mc": "忻州市"
        }, {
            "fdm": "14",
            "dm": "141000",
            "mc": "临汾市"
        }, {
            "fdm": "14",
            "dm": "141100",
            "mc": "吕梁市"
        }]
    },
    {
        "dm": "150000",
        "mc": "内蒙古自治区",
        "children": [{
            "fdm": "15",
            "dm": "150100",
            "mc": "呼和浩特市"
        }, {
            "fdm": "15",
            "dm": "150200",
            "mc": "包头市"
        }, {
            "fdm": "15",
            "dm": "150300",
            "mc": "乌海市"
        }, {
            "fdm": "15",
            "dm": "150400",
            "mc": "赤峰市"
        }, {
            "fdm": "15",
            "dm": "150500",
            "mc": "通辽市"
        }, {
            "fdm": "15",
            "dm": "150600",
            "mc": "鄂尔多斯市"
        }, {
            "fdm": "15",
            "dm": "150700",
            "mc": "呼伦贝尔市"
        }, {
            "fdm": "15",
            "dm": "150800",
            "mc": "巴彦淖尔市"
        }, {
            "fdm": "15",
            "dm": "150900",
            "mc": "乌兰察布市"
        }, {
            "fdm": "15",
            "dm": "152200",
            "mc": "兴安盟"
        }, {
            "fdm": "15",
            "dm": "152500",
            "mc": "锡林郭勒盟"
        }, {
            "fdm": "15",
            "dm": "152600",
            "mc": "乌兰察布盟"
        }, {
            "fdm": "15",
            "dm": "152900",
            "mc": "阿拉善盟"
        }]
    }, {
        "dm": "210000",
        "mc": "辽宁省",
        "children": [{
            "fdm": "21",
            "dm": "210100",
            "mc": "沈阳市"
        }, {
            "fdm": "21",
            "dm": "210200",
            "mc": "大连市"
        }, {
            "fdm": "21",
            "dm": "210300",
            "mc": "鞍山市"
        }, {
            "fdm": "21",
            "dm": "210400",
            "mc": "抚顺市"
        }, {
            "fdm": "21",
            "dm": "210500",
            "mc": "本溪市"
        }, {
            "fdm": "21",
            "dm": "210600",
            "mc": "丹东市"
        }, {
            "fdm": "21",
            "dm": "210700",
            "mc": "锦州市"
        }, {
            "fdm": "21",
            "dm": "210800",
            "mc": "营口市"
        }, {
            "fdm": "21",
            "dm": "210900",
            "mc": "阜新市"
        }, {
            "fdm": "21",
            "dm": "211000",
            "mc": "辽阳市"
        }, {
            "fdm": "21",
            "dm": "211100",
            "mc": "盘锦市"
        }, {
            "fdm": "21",
            "dm": "211200",
            "mc": "铁岭市"
        }, {
            "fdm": "21",
            "dm": "211300",
            "mc": "朝阳市"
        }, {
            "fdm": "21",
            "dm": "211400",
            "mc": "葫芦岛市"
        }]
    },
    {
        "dm": "220000",
        "mc": "吉林省",
        "children": [{
            "fdm": "22",
            "dm": "220300",
            "mc": "四平市"
        }, {
            "fdm": "22",
            "dm": "220400",
            "mc": "辽源市"
        }, {
            "fdm": "22",
            "dm": "220500",
            "mc": "通化市"
        }, {
            "fdm": "22",
            "dm": "220600",
            "mc": "白山市"
        }, {
            "fdm": "22",
            "dm": "220700",
            "mc": "松原市"
        }, {
            "fdm": "22",
            "dm": "220800",
            "mc": "白城市"
        }, {
            "fdm": "22",
            "dm": "222400",
            "mc": "延边朝鲜族自治州"
        }, {
            "fdm": "22",
            "dm": "220100",
            "mc": "长春市"
        }, {
            "fdm": "22",
            "dm": "220200",
            "mc": "吉林市"
        }]
    }, {
        "dm": "330000",
        "mc": "浙江省",
        "children": [{
            "fdm": "33",
            "dm": "330100",
            "mc": "杭州市"
        }, {
            "fdm": "33",
            "dm": "330200",
            "mc": "宁波市"
        }, {
            "fdm": "33",
            "dm": "330300",
            "mc": "温州市"
        }, {
            "fdm": "33",
            "dm": "330400",
            "mc": "嘉兴市"
        }, {
            "fdm": "33",
            "dm": "330500",
            "mc": "湖州市"
        }, {
            "fdm": "33",
            "dm": "330600",
            "mc": "绍兴市"
        }, {
            "fdm": "33",
            "dm": "330700",
            "mc": "金华市"
        }, {
            "fdm": "33",
            "dm": "330800",
            "mc": "衢州市"
        }, {
            "fdm": "33",
            "dm": "330900",
            "mc": "舟山市"
        }, {
            "fdm": "33",
            "dm": "331000",
            "mc": "台州市"
        }, {
            "fdm": "33",
            "dm": "331100",
            "mc": "丽水市"
        }]
    },
    {
        "dm": "370000",
        "mc": "山东省",
        "children": [{
            "fdm": "37",
            "dm": "370100",
            "mc": "济南市"
        }, {
            "fdm": "37",
            "dm": "370200",
            "mc": "青岛市"
        }, {
            "fdm": "37",
            "dm": "370300",
            "mc": "淄博市"
        }, {
            "fdm": "37",
            "dm": "370400",
            "mc": "枣庄市"
        }, {
            "fdm": "37",
            "dm": "370500",
            "mc": "东营市"
        }, {
            "fdm": "37",
            "dm": "370600",
            "mc": "烟台市"
        }, {
            "fdm": "37",
            "dm": "370700",
            "mc": "潍坊市"
        }, {
            "fdm": "37",
            "dm": "370800",
            "mc": "济宁市"
        }, {
            "fdm": "37",
            "dm": "370900",
            "mc": "泰安市"
        }, {
            "fdm": "37",
            "dm": "371000",
            "mc": "威海市"
        }, {
            "fdm": "37",
            "dm": "371100",
            "mc": "省日照市"
        }, {
            "fdm": "37",
            "dm": "371200",
            "mc": "莱芜市"
        }, {
            "fdm": "37",
            "dm": "371300",
            "mc": "临沂市"
        }, {
            "fdm": "37",
            "dm": "371400",
            "mc": "德州市"
        }, {
            "fdm": "37",
            "dm": "371500",
            "mc": "聊城市"
        }, {
            "fdm": "37",
            "dm": "371600",
            "mc": "滨州市"
        }, {
            "fdm": "37",
            "dm": "371700",
            "mc": "菏泽市"
        }, {
            "fdm": "37",
            "dm": "372100",
            "mc": "齐鲁石化公司"
        }, {
            "fdm": "37",
            "dm": "372200",
            "mc": "煤炭管理局"
        }, {
            "fdm": "37",
            "dm": "373000",
            "mc": "胜利油田"
        }]
    },
    {
        "dm": "410000",
        "mc": "河南省",
        "children": [{
            "fdm": "41",
            "dm": "410100",
            "mc": "郑州市"
        }, {
            "fdm": "41",
            "dm": "410200",
            "mc": "开封市"
        }, {
            "fdm": "41",
            "dm": "410300",
            "mc": "洛阳市"
        }, {
            "fdm": "41",
            "dm": "410400",
            "mc": "平顶山市"
        }, {
            "fdm": "41",
            "dm": "410500",
            "mc": "安阳市"
        }, {
            "fdm": "41",
            "dm": "410600",
            "mc": "鹤壁市"
        }, {
            "fdm": "41",
            "dm": "410700",
            "mc": "新乡市"
        }, {
            "fdm": "41",
            "dm": "410800",
            "mc": "焦作市"
        }, {
            "fdm": "41",
            "dm": "410900",
            "mc": "濮阳市"
        }, {
            "fdm": "41",
            "dm": "411000",
            "mc": "许昌市"
        }, {
            "fdm": "41",
            "dm": "411100",
            "mc": "漯河市"
        }, {
            "fdm": "41",
            "dm": "411200",
            "mc": "三门峡市"
        }, {
            "fdm": "41",
            "dm": "411300",
            "mc": "南阳市"
        }, {
            "fdm": "41",
            "dm": "411400",
            "mc": "商丘市"
        }, {
            "fdm": "41",
            "dm": "411500",
            "mc": "信阳市"
        }, {
            "fdm": "41",
            "dm": "411600",
            "mc": "周口市"
        }, {
            "fdm": "41",
            "dm": "411700",
            "mc": "驻马店市"
        }]
    },
    {
        "dm": "340000",
        "mc": "安徽省",
        "children": [{
            "fdm": "34",
            "dm": "340100",
            "mc": "合肥市"
        }, {
            "fdm": "34",
            "dm": "340200",
            "mc": "芜湖市"
        }, {
            "fdm": "34",
            "dm": "340300",
            "mc": "蚌埠市"
        }, {
            "fdm": "34",
            "dm": "340400",
            "mc": "淮南市"
        }, {
            "fdm": "34",
            "dm": "340500",
            "mc": "马鞍山市"
        }, {
            "fdm": "34",
            "dm": "340600",
            "mc": "淮北市"
        }, {
            "fdm": "34",
            "dm": "340700",
            "mc": "铜陵市"
        }, {
            "fdm": "34",
            "dm": "340800",
            "mc": "安庆市"
        }, {
            "fdm": "34",
            "dm": "341000",
            "mc": "黄山市"
        }, {
            "fdm": "34",
            "dm": "341100",
            "mc": "滁州市"
        }, {
            "fdm": "34",
            "dm": "341200",
            "mc": "阜阳市"
        }, {
            "fdm": "34",
            "dm": "341300",
            "mc": "宿州市"
        }, {
            "fdm": "34",
            "dm": "341400",
            "mc": "巢湖市"
        }, {
            "fdm": "34",
            "dm": "341500",
            "mc": "六安市"
        }, {
            "fdm": "34",
            "dm": "341600",
            "mc": "亳州市"
        }, {
            "fdm": "34",
            "dm": "341700",
            "mc": "池州市"
        }, {
            "fdm": "34",
            "dm": "341800",
            "mc": "宣城市"
        }]
    },
    {
        "dm": "360000",
        "mc": "江西省",
        "children": [{
            "fdm": "36",
            "dm": "360100",
            "mc": "南昌市"
        }, {
            "fdm": "36",
            "dm": "360200",
            "mc": "景德镇市"
        }, {
            "fdm": "36",
            "dm": "360300",
            "mc": "萍乡市"
        }, {
            "fdm": "36",
            "dm": "360400",
            "mc": "九江市"
        }, {
            "fdm": "36",
            "dm": "360500",
            "mc": "新余市"
        }, {
            "fdm": "36",
            "dm": "360600",
            "mc": "鹰潭市"
        }, {
            "fdm": "36",
            "dm": "360700",
            "mc": "赣州市"
        }, {
            "fdm": "36",
            "dm": "360800",
            "mc": "吉安市"
        }, {
            "fdm": "36",
            "dm": "360900",
            "mc": "宜春市"
        }, {
            "fdm": "36",
            "dm": "361000",
            "mc": "抚州市"
        }, {
            "fdm": "36",
            "dm": "361100",
            "mc": "上饶市"
        }]
    },
    {
        "dm": "460000",
        "mc": "海南省",
        "children": [{
            "fdm": "46",
            "dm": "460100",
            "mc": "海口市"
        }, {
            "fdm": "46",
            "dm": "460200",
            "mc": "三亚市"
        }, {
            "fdm": "46",
            "dm": "469000",
            "mc": "省直辖县级行政单位"
        }]
    },
    {
        "dm": "500000",
        "mc": "重庆市",
        "children": [{
            "fdm": "50",
            "dm": "500100",
            "mc": "市辖区"
        }, {
            "fdm": "50",
            "dm": "500200",
            "mc": "重庆市县"
        }, {
            "fdm": "50",
            "dm": "500300",
            "mc": "重庆市市"
        }]
    }, {
        "dm": "510000",
        "mc": "四川省",
        "children": [{
            "fdm": "51",
            "dm": "510100",
            "mc": "成都市"
        }, {
            "fdm": "51",
            "dm": "510300",
            "mc": "自贡市"
        }, {
            "fdm": "51",
            "dm": "510400",
            "mc": "攀枝花市"
        }, {
            "fdm": "51",
            "dm": "510500",
            "mc": "泸州市"
        }, {
            "fdm": "51",
            "dm": "510600",
            "mc": "德阳市"
        }, {
            "fdm": "51",
            "dm": "510700",
            "mc": "绵阳市"
        }, {
            "fdm": "51",
            "dm": "510800",
            "mc": "广元市"
        }, {
            "fdm": "51",
            "dm": "510900",
            "mc": "遂宁市"
        }, {
            "fdm": "51",
            "dm": "511000",
            "mc": "内江市"
        }, {
            "fdm": "51",
            "dm": "511100",
            "mc": "乐山市"
        }, {
            "fdm": "51",
            "dm": "511300",
            "mc": "南充市"
        }, {
            "fdm": "51",
            "dm": "511400",
            "mc": "眉山市"
        }, {
            "fdm": "51",
            "dm": "511500",
            "mc": "宜宾市"
        }, {
            "fdm": "51",
            "dm": "511600",
            "mc": "广安市"
        }, {
            "fdm": "51",
            "dm": "511700",
            "mc": "达州市"
        }, {
            "fdm": "51",
            "dm": "511800",
            "mc": "雅安市"
        }, {
            "fdm": "51",
            "dm": "511900",
            "mc": "巴中市"
        }, {
            "fdm": "51",
            "dm": "512000",
            "mc": "资阳市"
        }, {
            "fdm": "51",
            "dm": "513200",
            "mc": "阿坝藏族羌族自治州"
        }, {
            "fdm": "51",
            "dm": "513300",
            "mc": "甘孜藏族自治州"
        }, {
            "fdm": "51",
            "dm": "513400",
            "mc": "凉山彝族自治州"
        }]
    },
    {
        "dm": "420000",
        "mc": "湖北省",
        "children": [{
            "fdm": "42",
            "dm": "420100",
            "mc": "武汉市"
        }, {
            "fdm": "42",
            "dm": "420200",
            "mc": "黄石市"
        }, {
            "fdm": "42",
            "dm": "420300",
            "mc": "十堰市"
        }, {
            "fdm": "42",
            "dm": "420500",
            "mc": "宜昌市"
        }, {
            "fdm": "42",
            "dm": "420600",
            "mc": "襄樊市"
        }, {
            "fdm": "42",
            "dm": "420700",
            "mc": "鄂州市"
        }, {
            "fdm": "42",
            "dm": "420800",
            "mc": "荆门市"
        }, {
            "fdm": "42",
            "dm": "420900",
            "mc": "孝感市"
        }, {
            "fdm": "42",
            "dm": "421000",
            "mc": "荆州市"
        }, {
            "fdm": "42",
            "dm": "421100",
            "mc": "黄冈市"
        }, {
            "fdm": "42",
            "dm": "421200",
            "mc": "咸宁市"
        }, {
            "fdm": "42",
            "dm": "421300",
            "mc": "随州市"
        }, {
            "fdm": "42",
            "dm": "422800",
            "mc": "恩施土家族苗族自治州"
        }, {
            "fdm": "42",
            "dm": "429000",
            "mc": "省直辖行政单位"
        }]
    },
    {
        "dm": "430000",
        "mc": "湖南省",
        "children": [{
            "fdm": "43",
            "dm": "430100",
            "mc": "长沙市"
        }, {
            "fdm": "43",
            "dm": "430200",
            "mc": "株洲市"
        }, {
            "fdm": "43",
            "dm": "430300",
            "mc": "湘潭市"
        }, {
            "fdm": "43",
            "dm": "430400",
            "mc": "衡阳市"
        }, {
            "fdm": "43",
            "dm": "430500",
            "mc": "邵阳市"
        }, {
            "fdm": "43",
            "dm": "430600",
            "mc": "岳阳市"
        }, {
            "fdm": "43",
            "dm": "430700",
            "mc": "常德市"
        }, {
            "fdm": "43",
            "dm": "430800",
            "mc": "张家界市"
        }, {
            "fdm": "43",
            "dm": "430900",
            "mc": "益阳市"
        }, {
            "fdm": "43",
            "dm": "431000",
            "mc": "郴州市"
        }, {
            "fdm": "43",
            "dm": "431100",
            "mc": "永州市"
        }, {
            "fdm": "43",
            "dm": "431200",
            "mc": "怀化市"
        }, {
            "fdm": "43",
            "dm": "431300",
            "mc": "娄底市"
        }, {
            "fdm": "43",
            "dm": "433100",
            "mc": "湘西土家族苗族自治州"
        }]
    },
    {
        "dm": "440000",
        "mc": "广东省",
        "children": [{
            "fdm": "44",
            "dm": "440100",
            "mc": "广州市"
        }, {
            "fdm": "44",
            "dm": "440200",
            "mc": "韶关市"
        }, {
            "fdm": "44",
            "dm": "440300",
            "mc": "深圳市"
        }, {
            "fdm": "44",
            "dm": "440400",
            "mc": "珠海市"
        }, {
            "fdm": "44",
            "dm": "440500",
            "mc": "汕头市"
        }, {
            "fdm": "44",
            "dm": "440600",
            "mc": "佛山市"
        }, {
            "fdm": "44",
            "dm": "440700",
            "mc": "江门市"
        }, {
            "fdm": "44",
            "dm": "440800",
            "mc": "湛江市"
        }, {
            "fdm": "44",
            "dm": "440900",
            "mc": "茂名市"
        }, {
            "fdm": "44",
            "dm": "441200",
            "mc": "肇庆市"
        }, {
            "fdm": "44",
            "dm": "441300",
            "mc": "惠州市"
        }, {
            "fdm": "44",
            "dm": "441400",
            "mc": "梅州市"
        }, {
            "fdm": "44",
            "dm": "441500",
            "mc": "汕尾市"
        }, {
            "fdm": "44",
            "dm": "441600",
            "mc": "河源市"
        }, {
            "fdm": "44",
            "dm": "441700",
            "mc": "阳江市"
        }, {
            "fdm": "44",
            "dm": "441800",
            "mc": "清远市"
        }, {
            "fdm": "44",
            "dm": "441900",
            "mc": "东莞市"
        }, {
            "fdm": "44",
            "dm": "442000",
            "mc": "中山市"
        }, {
            "fdm": "44",
            "dm": "445100",
            "mc": "潮州市"
        }, {
            "fdm": "44",
            "dm": "445200",
            "mc": "揭阳市"
        }, {
            "fdm": "44",
            "dm": "445300",
            "mc": "云浮市"
        }]
    },
    {
        "dm": "450000",
        "mc": "广西壮族自治区",
        "children": [{
            "fdm": "45",
            "dm": "451200",
            "mc": "河池市"
        }, {
            "fdm": "45",
            "dm": "451300",
            "mc": "来宾市"
        }, {
            "fdm": "45",
            "dm": "451400",
            "mc": "崇左市"
        }, {
            "fdm": "45",
            "dm": "450100",
            "mc": "南宁市"
        }, {
            "fdm": "45",
            "dm": "450200",
            "mc": "柳州市"
        }, {
            "fdm": "45",
            "dm": "450300",
            "mc": "桂林市"
        }, {
            "fdm": "45",
            "dm": "450400",
            "mc": "梧州市"
        }, {
            "fdm": "45",
            "dm": "450500",
            "mc": "北海市"
        }, {
            "fdm": "45",
            "dm": "450600",
            "mc": "防城港市"
        }, {
            "fdm": "45",
            "dm": "450700",
            "mc": "钦州市"
        }, {
            "fdm": "45",
            "dm": "450800",
            "mc": "贵港市"
        }, {
            "fdm": "45",
            "dm": "450900",
            "mc": "玉林市"
        }, {
            "fdm": "45",
            "dm": "451000",
            "mc": "百色市"
        }, {
            "fdm": "45",
            "dm": "451100",
            "mc": "贺州市"
        }]
    }, {
        "dm": "520000",
        "mc": "贵州省",
        "children": [{
            "fdm": "52",
            "dm": "520100",
            "mc": "贵阳市"
        }, {
            "fdm": "52",
            "dm": "520200",
            "mc": "六盘水市"
        }, {
            "fdm": "52",
            "dm": "520300",
            "mc": "遵义市"
        }, {
            "fdm": "52",
            "dm": "520400",
            "mc": "安顺市"
        }, {
            "fdm": "52",
            "dm": "522200",
            "mc": "铜仁地区"
        }, {
            "fdm": "52",
            "dm": "522300",
            "mc": "黔西南布依族苗族自治州"
        }, {
            "fdm": "52",
            "dm": "522400",
            "mc": "毕节地区"
        }, {
            "fdm": "52",
            "dm": "522600",
            "mc": "黔东南苗族侗族自治州"
        }, {
            "fdm": "52",
            "dm": "522700",
            "mc": "黔南布依族苗族自治州"
        }]
    },
    {
        "dm": "530000",
        "mc": "云南省",
        "children": [{
            "fdm": "53",
            "dm": "530100",
            "mc": "昆明市"
        }, {
            "fdm": "53",
            "dm": "530300",
            "mc": "曲靖市"
        }, {
            "fdm": "53",
            "dm": "530400",
            "mc": "玉溪市"
        }, {
            "fdm": "53",
            "dm": "530500",
            "mc": "保山市"
        }, {
            "fdm": "53",
            "dm": "530600",
            "mc": "昭通市"
        }, {
            "fdm": "53",
            "dm": "530700",
            "mc": "丽江市"
        }, {
            "fdm": "53",
            "dm": "530800",
            "mc": "思茅市"
        }, {
            "fdm": "53",
            "dm": "530900",
            "mc": "临沧市"
        }, {
            "fdm": "53",
            "dm": "532300",
            "mc": "楚雄彝族自治州"
        }, {
            "fdm": "53",
            "dm": "532500",
            "mc": "红河哈尼族彝族自治州"
        }, {
            "fdm": "53",
            "dm": "532600",
            "mc": "文山壮族苗族自治州"
        }, {
            "fdm": "53",
            "dm": "532800",
            "mc": "西双版纳傣族自治州"
        }, {
            "fdm": "53",
            "dm": "532900",
            "mc": "大理白族自治州"
        }, {
            "fdm": "53",
            "dm": "533100",
            "mc": "德宏傣族景颇族自治州"
        }, {
            "fdm": "53",
            "dm": "533300",
            "mc": "怒江傈僳族自治州"
        }, {
            "fdm": "53",
            "dm": "533400",
            "mc": "迪庆藏族自治州"
        }]
    }, {
        "dm": "630000",
        "mc": "青海省",
        "children": [{
            "fdm": "63",
            "dm": "630100",
            "mc": "西宁市"
        }, {
            "fdm": "63",
            "dm": "632100",
            "mc": "海东地区"
        }, {
            "fdm": "63",
            "dm": "632200",
            "mc": "海北藏族自治州"
        }, {
            "fdm": "63",
            "dm": "632300",
            "mc": "黄南藏族自治州"
        }, {
            "fdm": "63",
            "dm": "632500",
            "mc": "海南藏族自治州"
        }, {
            "fdm": "63",
            "dm": "632600",
            "mc": "果洛藏族自治州"
        }, {
            "fdm": "63",
            "dm": "632700",
            "mc": "玉树藏族自治州"
        }, {
            "fdm": "63",
            "dm": "632800",
            "mc": "海西蒙古族藏族自治州"
        }]
    },
    {
        "dm": "640000",
        "mc": "宁夏回族自治区",
        "children": [{
            "fdm": "64",
            "dm": "640100",
            "mc": "银川市"
        }, {
            "fdm": "64",
            "dm": "640200",
            "mc": "石嘴山市"
        }, {
            "fdm": "64",
            "dm": "640300",
            "mc": "吴忠市"
        }, {
            "fdm": "64",
            "dm": "640400",
            "mc": "固原市"
        }, {
            "fdm": "64",
            "dm": "640500",
            "mc": "中卫市"
        }]
    },
    {
        "dm": "650000",
        "mc": "新疆维吾尔自治区",
        "children": [{
            "fdm": "65",
            "dm": "650100",
            "mc": "乌鲁木齐市"
        }, {
            "fdm": "65",
            "dm": "650200",
            "mc": "克拉玛依市"
        }, {
            "fdm": "65",
            "dm": "652100",
            "mc": "吐鲁番地区"
        }, {
            "fdm": "65",
            "dm": "652200",
            "mc": "哈密地区"
        }, {
            "fdm": "65",
            "dm": "652300",
            "mc": "昌吉回族自治州"
        }, {
            "fdm": "65",
            "dm": "652700",
            "mc": "博尔塔拉蒙古自治州"
        }, {
            "fdm": "65",
            "dm": "652800",
            "mc": "巴音郭楞蒙古自治州"
        }, {
            "fdm": "65",
            "dm": "652900",
            "mc": "阿克苏地区"
        }, {
            "fdm": "65",
            "dm": "653000",
            "mc": "克孜勒苏柯尔克孜自治州"
        }, {
            "fdm": "65",
            "dm": "653100",
            "mc": "喀什地区"
        }, {
            "fdm": "65",
            "dm": "653200",
            "mc": "和田地区"
        }, {
            "fdm": "65",
            "dm": "654000",
            "mc": "伊犁哈萨克自治州"
        }, {
            "fdm": "65",
            "dm": "654200",
            "mc": "塔城地区"
        }, {
            "fdm": "65",
            "dm": "654300",
            "mc": "阿勒泰地区"
        }, {
            "fdm": "65",
            "dm": "659000",
            "mc": "省直辖行政单位"
        }]
    },
    {
        "dm": "540000",
        "mc": "西藏自治区",
        "children": [{
            "fdm": "54",
            "dm": "540100",
            "mc": "拉萨市"
        }, {
            "fdm": "54",
            "dm": "542100",
            "mc": "昌都地区"
        }, {
            "fdm": "54",
            "dm": "542200",
            "mc": "山南地区"
        }, {
            "fdm": "54",
            "dm": "542300",
            "mc": "日喀则地区"
        }, {
            "fdm": "54",
            "dm": "542400",
            "mc": "那曲地区"
        }, {
            "fdm": "54",
            "dm": "542500",
            "mc": "阿里地区"
        }, {
            "fdm": "54",
            "dm": "542600",
            "mc": "林芝地区"
        }]
    },
    {
        "dm": "610000",
        "mc": "陕西省",
        "children": [{
            "fdm": "61",
            "dm": "610100",
            "mc": "西安市"
        }, {
            "fdm": "61",
            "dm": "610200",
            "mc": "铜川市"
        }, {
            "fdm": "61",
            "dm": "610300",
            "mc": "宝鸡市"
        }, {
            "fdm": "61",
            "dm": "610400",
            "mc": "咸阳市"
        }, {
            "fdm": "61",
            "dm": "610500",
            "mc": "渭南市"
        }, {
            "fdm": "61",
            "dm": "610600",
            "mc": "延安市"
        }, {
            "fdm": "61",
            "dm": "610700",
            "mc": "汉中市"
        }, {
            "fdm": "61",
            "dm": "610800",
            "mc": "榆林市"
        }, {
            "fdm": "61",
            "dm": "610900",
            "mc": "安康市"
        }, {
            "fdm": "61",
            "dm": "611000",
            "mc": "商洛市"
        }]
    },
    {
        "dm": "620000",
        "mc": "甘肃省",
        "children": [{
            "fdm": "62",
            "dm": "620700",
            "mc": "张掖市"
        }, {
            "fdm": "62",
            "dm": "620800",
            "mc": "平凉市"
        }, {
            "fdm": "62",
            "dm": "620900",
            "mc": "酒泉市"
        }, {
            "fdm": "62",
            "dm": "621000",
            "mc": "庆阳市"
        }, {
            "fdm": "62",
            "dm": "621100",
            "mc": "定西市"
        }, {
            "fdm": "62",
            "dm": "621200",
            "mc": "陇南市"
        }, {
            "fdm": "62",
            "dm": "622900",
            "mc": "临夏回族自治州"
        }, {
            "fdm": "62",
            "dm": "623000",
            "mc": "甘南藏族自治州"
        }, {
            "fdm": "62",
            "dm": "620100",
            "mc": "兰州市"
        }, {
            "fdm": "62",
            "dm": "620200",
            "mc": "嘉峪关市"
        }, {
            "fdm": "62",
            "dm": "620300",
            "mc": "金昌市"
        }, {
            "fdm": "62",
            "dm": "620400",
            "mc": "白银市"
        }, {
            "fdm": "62",
            "dm": "620500",
            "mc": "天水市"
        }, {
            "fdm": "62",
            "dm": "620600",
            "mc": "武威市"
        }]
    },
    {
        "dm": "710000",
        "mc": "台湾省",
    },
    {
        "dm": "810000",
        "mc": "香港特别行政区",
    },
    {
        "dm": "820000",
        "mc": "澳门特别行政区",
    }
]

export const peopleDetail = [{
        key: "ryjbxxBfrxm",
        label: "姓名",
        icon: "md-document",
    },
    {
        key: "ryjbxxBfrsfzh",
        label: "身份证号",
        custom: "el-icon-location-outline",
    },
    {
        key: "ryjbxxBfrylx",
        label: "类型",
        custom: "el-icon-location-outline",
    },
    {
        key: "ryjbxxXb",
        label: "性别",
        icon: "md-document",
    },
    {
        key: "ryjbxxCsrq",
        label: "出生日期",
        icon: "md-time",
    },
    {
        key: "ryjbxxMz",
        label: "民族",
        icon: "md-people",
    },
    {
        key: "ryjbxxJg",
        label: "籍贯",
        custom: "el-icon-location-outline",
    },
    {
        key: "ryjbxxHjdq",
        label: "户籍地区",
        custom: "el-icon-location-outline",
    },
    {
        key: "ryjbxxHjxz",
        label: "户籍详址",
        custom: "el-icon-location-outline",
    },
    {
        key: "ryjbxxXzd",
        label: "现住地",
        custom: "el-icon-location-outline",
    },
    {
        key: "ryjbxxZy",
        label: "职业",
        custom: "el-icon-location-outline",
    },
    {
        key: "ryjbxxZzmm",
        label: "政治面貌",
        custom: "el-icon-location-outline",
    },
    {
        key: "ryjbxxHyzk",
        label: "婚姻状况",
        icon: "md-people",
    },
    {
        key: "ryjbxxLxdh",
        label: "联系电话",
        icon: "md-time",
    },
    {
        key: "ryjbxxBfrxm",
        label: "联系人",
        icon: "md-people",
    },
    {
        key: "ryjbxxCydw",
        label: "从业单位",
        icon: "md-document",
    },
    {
        key: "ryjbxxCydz",
        label: "从业地址",
        icon: "md-time",
    },
    {
        key: "ryjbxxGzdj",
        label: "关注等级",
        custom: "el-icon-location-outline",
    },
    {
        key: "ryjbxxZsqk",
        label: "住宿情况",
        icon: "md-document",
    },
    {
        key: "ryjbxxLmsy",
        label: "来闽事由",
        custom: "el-icon-location-outline",
    },
    {
        key: "ryjbxxJxlb",
        label: "就学类别",
        icon: "md-document",
    },
    {
        key: "ryjbxxSzyxzy",
        label: "所在院系专业",
        custom: "el-icon-location-outline",
    },
    {
        key: "ryjbxxBj",
        label: "班级",
        icon: "md-document",
    },
    {
        key: "ryjbxxRxsj",
        label: "入学时间",
        custom: "el-icon-location-outline",
    },
    {
        key: "ryjbxxXyzt",
        label: "学业状态",
        icon: "md-document",
    },
    {
        key: "ryjbxxSfngb",
        label: "是否内高班",
        custom: "el-icon-location-outline",
    },
]

export const peopleCols = {
    "xxqtxx": [{
            "label": "家庭关系",
            "key": "jtgxxx",
            "table": [{
                    "align": "center",
                    "key": "jtXm",
                    "title": "姓名",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "jtXb",
                    "title": "性别",
                    "tooltip": true,
                    "slot": "xb"
                },
                {
                    "align": "center",
                    "key": "jtSfzh",
                    "title": "身份证",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "jtRygx",
                    "title": "人员关系",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "jtDhhm",
                    "title": "电话号码",
                    "tooltip": true
                }
            ]
        },
        {
            "label": "出入境证件",
            "key": "crjzjxx",
            "table": [{
                    "align": "center",
                    "key": "zjlb",
                    "title": "证件类别",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "zjhm",
                    "title": "证件号码",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "qfrq",
                    "title": "签发日期",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "yxqz",
                    "title": "有效期至",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "qfd",
                    "title": "签发地",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "kz1",
                    "title": "备注",
                    "tooltip": true
                }
            ]
        }, {
            "label": "出入境记录",
            "key": "crjjlxx",
            "table": [{
                    "align": "center",
                    "key": "crbz",
                    "title": "出境/入境",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "crjsj",
                    "title": "出入境时间",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "zjhm",
                    "title": "护照号码",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "crjgj",
                    "title": "出入境国家",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "jtfs",
                    "title": "交通方式",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "jtgjbz",
                    "title": "交通工具标识",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "ka",
                    "title": "经过卡口",
                    "tooltip": true
                }
            ]
        }, {
            "label": "亲属被打击处理情况",
            "key": "qsbdjclxx",
            "table": [{
                    "align": "center",
                    "key": "crbz",
                    "title": "出境/入境",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "crjsj",
                    "title": "出入境时间",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "zjhm",
                    "title": "护照号码",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "crjgj",
                    "title": "出入境国家",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "jtfs",
                    "title": "交通方式",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "jtgjbz",
                    "title": "交通工具标识",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "ka",
                    "title": "经过卡口",
                    "tooltip": true
                }
            ]
        }, {
            "label": "亲属出境未归情况",
            "key": "qscjwgqk",
            "table": [{
                    "align": "center",
                    "key": "qsxm",
                    "title": "亲属姓名",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "qssfzh",
                    "title": "亲属身份证号",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "gx",
                    "title": "关系",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "cjsj",
                    "title": "出境时间",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "cjyy",
                    "title": "出境原因",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "sfzt",
                    "title": "是否在逃",
                    "tooltip": true,
                    "selectData": [{
                        "key": "是"
                    }, {
                        "key": "否"
                    }]
                },
                {
                    "align": "center",
                    "key": "bz",
                    "title": "备注",
                    "tooltip": true
                }
            ]
        }
    ],
    "sktxx": [{
            "label": "随行家属",
            "key": "sxjsxx",
            "isAdd": false,
            "table": [{
                    "align": "center",
                    "key": "qsgxxxXm",
                    "title": "随行家属姓名",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "qsgxxxSfzh",
                    "title": "随行家属身份证",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "qsgxxxGx",
                    "title": "随行家属关系",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "qsgxxxJs",
                    "title": "随行家属儿女角色",
                    "tooltip": true
                }
            ]
        }, {
            "label": "出入境证件",
            "key": "crjzjxx",
            "table": [{
                    "align": "center",
                    "key": "zjlb",
                    "title": "证件类别",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "zjhm",
                    "title": "证件号码",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "qfrq",
                    "title": "签发日期",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "yxqz",
                    "title": "有效期至",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "qfd",
                    "title": "签发地",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "kz1",
                    "title": "备注",
                    "tooltip": true
                }
            ]
        }, {
            "label": "出入境记录",
            "key": "crjjlxx",
            "table": [{
                    "align": "center",
                    "key": "crbz",
                    "title": "出境/入境",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "crjsj",
                    "title": "出入境时间",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "zjhm",
                    "title": "护照号码",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "crjgj",
                    "title": "出入境国家",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "jtfs",
                    "title": "交通方式",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "jtgjbz",
                    "title": "交通工具标识",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "ka",
                    "title": "经过卡口",
                    "tooltip": true
                }
            ]
        }, {
            "label": "亲属被打击处理情况",
            "key": "crjzjxx",
            "table": [{
                    "align": "center",
                    "key": "crbz",
                    "title": "出境/入境",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "crjsj",
                    "title": "出入境时间",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "zjhm",
                    "title": "护照号码",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "crjgj",
                    "title": "出入境国家",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "jtfs",
                    "title": "交通方式",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "jtgjbz",
                    "title": "交通工具标识",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "ka",
                    "title": "经过卡口",
                    "tooltip": true
                }
            ]
        }, {
            "label": "亲属出境未归情况",
            "key": "qscjwgqk",
            "table": [{
                    "align": "center",
                    "key": "qsxm",
                    "title": "亲属姓名",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "qssfzh",
                    "title": "亲属身份证号",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "gx",
                    "title": "关系",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "cjsj",
                    "title": "出境时间",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "cjyy",
                    "title": "出境原因",
                    "tooltip": true
                },
                {
                    "align": "center",
                    "key": "sfzt",
                    "title": "是否在逃",
                    "tooltip": true,
                    "selectData": [{
                        "key": "是"
                    }, {
                        "key": "否"
                    }]
                },
                {
                    "align": "center",
                    "key": "bz",
                    "title": "备注",
                    "tooltip": true
                }
            ]
        }

    ]
}

export const statisticalCode = [
  {
    id:1,
    name:'烧烤从业人员'
  },
  {
  id:2,
  name:'流动摊贩'
},
  {
  id:3,
  name:'零散务工经商随同儿童'
},
  {
  id:4,
  name:'其他零散务工人员'
}
]

export const cityName = [
  {
    id:1,
    name:'福建省'
  },
  {
    id:2,
    name:'福州市'
  },
  {
    id:3,
    name:'厦门市'
  },
  {
    id:4,
    name:'莆田市'
  },
  {
    id:5,
    name:'三明市'
  },
  {
    id:6,
    name:'泉州市'
  },
  {
    id:7,
    name:'漳州市'
  },
  {
    id:8,
    name:'南平市'
  },
  {
    id:9,
    name:'龙岩市'
  },
  {
    id:10,
    name:'宁德市'
  },
  {
    id:11,
    name:'平潭'
  }
]


export const cityCode = {
    "3500": "福建省",
    "3501": "福州市",
    "3502": "厦门市",
    "3503": "莆田市",
    "3504": "三明市",
    "3505": "泉州市",
    "3506": "漳州市",
    "3507": "南平市",
    "3508": "龙岩市",
    "3509": "宁德市",
    "3510": "平潭",
    "3511": "福州铁路",
    "3512": "厦门铁路",
    "350000": "福建省",
    "350100": "福州市",
    "350102": "鼓楼区",
    "350103": "台江区",
    "350104": "仓山区",
    "350105": "马尾区",
    "350108": "上街区",
    "350111": "晋安区",
    "350121": "闽侯县",
    "350122": "连江县",
    "350123": "罗源县",
    "350124": "闽清县",
    "350125": "永泰县",
    "350181": "福清市",
    "350182": "长乐市",
    "350200": "厦门市",
    "350203": "思明区",
    "350205": "海沧区",
    "350206": "湖里区",
    "350211": "集美区",
    "350212": "同安区",
    "350213": "翔安区",
    "350298": "厦门公共交通",
    "350299": "高崎机场分局",
    "350300": "莆田市",
    "350302": "城厢区",
    "350303": "涵江区",
    "350304": "荔城区",
    "350305": "秀屿区",
    "350306": "莆田湄洲湾开发区",
    "350322": "仙游县",
    "350400": "三明市",
    "350402": "梅列区",
    "350403": "三元区",
    "350421": "明溪县",
    "350423": "清流县",
    "350424": "宁化县",
    "350425": "大田县",
    "350426": "尤溪县",
    "350427": "沙县",
    "350428": "将乐县",
    "350429": "泰宁县",
    "350430": "建宁县",
    "350481": "永安市",
    "350500": "泉州市",
    "350502": "鲤城区",
    "350503": "丰泽区",
    "350504": "洛江区",
    "350505": "泉港区",
    "350519": "泉州台商区",
    "350521": "惠安县",
    "350524": "安溪县",
    "350525": "永春县",
    "350526": "德化县",
    "350581": "石狮市",
    "350582": "晋江市",
    "350583": "南安市",
    "350596": "晋江国际机场",
    "350597": "泉州开发区",
    "350598": "油城",
    "350599": "天湖山",
    "350630": "古雷区",
    "350696":'漳州高新区',
    "350600": "漳州市",
    "350602": "芗城区",
    "350603": "龙文区",
    "350622": "云霄县",
    "350623": "漳浦县",
    "350624": "诏安县",
    "350625": "长泰县",
    "350626": "东山县",
    "350627": "南靖县",
    "350628": "平和县",
    "350629": "华安县",
    "350681": "龙海市",
    "350698": "漳州台商区",
    "350699": "漳州开发区",
    "350700": "南平市",
    "350702": "延平区",
    "350721": "顺昌县",
    "350722": "浦城县",
    "350723": "光泽县",
    "350724": "松溪县",
    "350725": "政和县",
    "350781": "邵武市",
    "350782": "武夷山市",
    "350783": "建瓯市",
    "350784": "建阳区",
    "350800": "龙岩市",
    "350802": "新罗区",
    "350821": "长汀县",
    "350822": "永定区",
    "350823": "上杭县",
    "350824": "武平县",
    "350825": "连城县",
    "350881": "漳平市",
    "350900": "宁德市",
    "350902": "蕉城区",
    "350921": "霞浦县",
    "350922": "古田县",
    "350923": "屏南县",
    "350924": "寿宁县",
    "350925": "周宁县",
    "350926": "柘荣县",
    "350981": "福安市",
    "350982": "福鼎市",
    "350999": "东侨开发区",
    "351000": "平潭综合实验区",
    "351100": "福州铁路",
    "351200": "厦门铁路"
}

export const deptListCode = [{
    "id": "350000000000",
    "name": "福建省公安厅"
}, {
    "id": "350000410000",
    "name": "福建省公安厅反恐怖总队"
}, {
    "id": "350000412100",
    "name": "福建省公安厅反恐怖总队一支队"
}, {
    "id": "350000412200",
    "name": "福建省公安厅反恐怖总队二支队"
}, {
    "id": "350000412300",
    "name": "福建省公安厅反恐怖总队三支队"
}, {
    "id": "350000412400",
    "name": "福建省公安厅反恐怖总队四支队"
}, {
    "id": "35000041gafk",
    "name": "公安部反恐局"
}, {
    "id": "350100000000",
    "name": "福建省福州市"
}, {
    "id": "350100410000",
    "name": "福州市公安局反恐怖支队"
}, {
    "id": "350100410100",
    "name": "福州市公安局反恐怖支队综合队"
}, {
    "id": "350100410200",
    "name": "福州市公安局反恐怖支队情报侦查队"
}, {
    "id": "350100410300",
    "name": "福州市公安局反恐怖支队防范应急队"
}, {
    "id": "350102500000",
    "name": "鼓楼分局巡特警反恐大队"
}, {
    "id": "350102500100",
    "name": "鼓楼分局巡特警反恐大队综合队"
}, {
    "id": "350102500200",
    "name": "鼓楼分局巡特警反恐大队反恐情报队"
}, {
    "id": "350102500300",
    "name": "鼓楼分局巡特警反恐大队巡特警一队"
}, {
    "id": "350102500400",
    "name": "鼓楼分局巡特警反恐大队巡特警二队"
}, {
    "id": "350103500000",
    "name": "台江分局巡特警反恐大队"
}, {
    "id": "350103500100",
    "name": "台江分局巡特警反恐大队综合队"
}, {
    "id": "350103500200",
    "name": "台江分局巡特警反恐大队反恐情报队"
}, {
    "id": "350103500300",
    "name": "台江分局巡特警反恐大队巡特警队"
}, {
    "id": "350104500000",
    "name": "仓山分局巡特警反恐大队"
}, {
    "id": "350104500100",
    "name": "仓山分局巡特警反恐大队综合队"
}, {
    "id": "350104500200",
    "name": "仓山分局巡特警反恐大队反恐情报队"
}, {
    "id": "350104500300",
    "name": "仓山分局巡特警反恐大队巡特警队"
}, {
    "id": "350105500000",
    "name": "市马尾区巡特警反恐大队"
}, {
    "id": "350105500100",
    "name": "马尾区巡特警反恐大队第一中队"
}, {
    "id": "350105500200",
    "name": "马尾区巡特警反恐大队第二中队"
}, {
    "id": "350108500000",
    "name": "上街（高新区）分局巡特警反恐大队"
}, {
    "id": "350108500100",
    "name": "上街（高新区）分局巡特警反恐大队反恐情报队"
}, {
    "id": "350108500200",
    "name": "上街（高新区）分局巡特警反恐大队巡特警队"
}, {
    "id": "350111500000",
    "name": "晋安分局巡特警反恐大队"
}, {
    "id": "350111500100",
    "name": "晋安分局巡特警反恐大队综合队"
}, {
    "id": "350111500200",
    "name": "晋安分局巡特警反恐大队反恐情报队"
}, {
    "id": "350111500300",
    "name": "晋安分局巡特警反恐大队巡特警队"
}, {
    "id": "350121500000",
    "name": "闽侯县公安局巡特警反恐大队"
}, {
    "id": "350122500000",
    "name": "连江县公安局巡特警反恐大队"
}, {
    "id": "350123500000",
    "name": "罗源县公安局巡特警反恐大队"
}, {
    "id": "350124500000",
    "name": "闽清县公安局巡特警反恐大队"
}, {
    "id": "350124500100",
    "name": "闽清县公安局巡特警反恐大队综合管理中队"
}, {
    "id": "350124500200",
    "name": "闽清县公安局巡特警反恐大队反恐处突中队"
}, {
    "id": "350124500300",
    "name": "闽清县公安局巡特警反恐大队巡逻中队"
}, {
    "id": "350125500000",
    "name": "永泰县公安局巡特警反恐大队"
}, {
    "id": "350181500000",
    "name": "福清市公安局巡特警反恐大队"
}, {
    "id": "350182500000",
    "name": "长乐市公安局巡特警反恐大队"
}, {
    "id": "350182500100",
    "name": "长乐市公安局巡特警反恐大队综合中队"
}, {
    "id": "350182500200",
    "name": "长乐市公安局巡特警反恐大队一中队"
}, {
    "id": "350182500300",
    "name": "长乐市公安局巡特警反恐大队二中队"
}, {
    "id": "350200000000",
    "name": "福建省厦门市"
}, {
    "id": "350200410000",
    "name": "厦门市公安局反恐怖支队"
}, {
    "id": "350200410100",
    "name": "厦门市公安局反恐怖支队一队"
}, {
    "id": "350200410200",
    "name": "厦门市公安局反恐怖支队二队"
}, {
    "id": "350200410300",
    "name": "厦门市公安局反恐怖支队三队"
}, {
    "id": "350200410400",
    "name": "厦门市公安局反恐怖支队情报大队"
}, {
    "id": "350203500000",
    "name": "思明分局巡特警反恐大队"
}, {
    "id": "350203500100",
    "name": "厦思明分局巡特警反恐大队一中队"
}, {
    "id": "350203500200",
    "name": "思明分局巡特警反恐大队二中队"
}, {
    "id": "350203500300",
    "name": "思明分局巡特警反恐大队三中队"
}, {
    "id": "350205500000",
    "name": "海沧分局巡特警反恐大队"
}, {
    "id": "350206500000",
    "name": "湖里分局特警队"
}, {
    "id": "350206500100",
    "name": "湖里分局巡特警反恐大队一中队"
}, {
    "id": "350206500200",
    "name": "湖里分局巡特警反恐大队二中队"
}, {
    "id": "350206500300",
    "name": "湖里分局巡特警反恐大队三中队"
}, {
    "id": "350211500000",
    "name": "集美分局巡特警反恐大队"
}, {
    "id": "350212500000",
    "name": "同安分局巡特警反恐大队"
}, {
    "id": "350213500000",
    "name": "翔安分局巡特警反恐大队"
}, {
    "id": "350300000000",
    "name": "福建省莆田市"
}, {
    "id": "350300410000",
    "name": "莆田市公安局反恐怖支队"
}, {
    "id": "350300S04100",
    "name": "莆田市森林公安局直属分局"
}, {
    "id": "350302500000",
    "name": "城厢分局巡特警反恐大队"
}, {
    "id": "350303500000",
    "name": "涵江分局巡特警反恐大队"
}, {
    "id": "350304500000",
    "name": "荔城分局巡特警反恐大队"
}, {
    "id": "350305500000",
    "name": "秀屿分局巡特警反恐大队"
}, {
    "id": "350306500000",
    "name": "湄洲湾北岸经济开发区分局巡特警反恐大队"
}, {
    "id": "350322500000",
    "name": "仙游县公安局巡特警反恐大队"
}, {
    "id": "350400000000",
    "name": "福建省三明市"
}, {
    "id": "350400330000",
    "name": "三明市公安局反恐维稳工作处"
}, {
    "id": "350400330100",
    "name": "三明市公安局反恐维稳工作处情报侦查队"
}, {
    "id": "350402210000",
    "name": "梅列分局巡特警反恐大队"
}, {
    "id": "350403210000",
    "name": "三元分局巡特警反恐大队"
}, {
    "id": "350421210000",
    "name": "明溪县巡特警反恐大队"
}, {
    "id": "350423210000",
    "name": "清流县巡特警反恐大队"
}, {
    "id": "350424210000",
    "name": "宁化县巡特警反恐大队"
}, {
    "id": "350424500100",
    "name": "宁化县巡特警反恐大队一中队"
}, {
    "id": "350424500200",
    "name": "宁化县巡特警反恐大队二中队"
}, {
    "id": "350424500300",
    "name": "宁化县巡特警反恐大队三中队"
}, {
    "id": "350425210000",
    "name": "大田县巡特警反恐大队"
}, {
    "id": "350426210000",
    "name": "尤溪县巡特警反恐大队"
}, {
    "id": "350426500001",
    "name": "尤溪县巡特警反恐大队特警中队"
}, {
    "id": "350426500002",
    "name": "尤溪县巡特警反恐大队综合情报中队"
}, {
    "id": "350427210000",
    "name": "沙县巡特警反恐大队"
}, {
    "id": "350428500000",
    "name": "将乐县巡特警反恐大队"
}, {
    "id": "350429500000",
    "name": "泰宁县巡特警反恐大队"
}, {
    "id": "350430210000",
    "name": "建宁县巡特警反恐大队"
}, {
    "id": "350430500100",
    "name": "建宁县巡特警反恐大队综合情报中队"
}, {
    "id": "350430500200",
    "name": "建宁县巡特警反恐大队一中队"
}, {
    "id": "350430500300",
    "name": "建宁县巡特警反恐大队二中队"
}, {
    "id": "350430500400",
    "name": "建宁县巡特警反恐大队三中队"
}, {
    "id": "350481210000",
    "name": "永安市巡特警反恐大队"
}, {
    "id": "350500000000",
    "name": "福建省泉州市"
}, {
    "id": "350500410000",
    "name": "泉州市公安局反恐怖支队"
}, {
    "id": "350502500000",
    "name": "鲤城分局巡特警反恐大队"
}, {
    "id": "350503500000",
    "name": "丰泽分局巡特警反恐大队"
}, {
    "id": "350504500000",
    "name": "洛江分局巡特警反恐大队"
}, {
    "id": "350505500000",
    "name": "泉港分局巡特警反恐大队"
}, {
    "id": "350519500000",
    "name": "泉州台商投资区分局巡特警反恐大队"
}, {
    "id": "350521500000",
    "name": "惠安县巡特警反恐大队"
}, {
    "id": "350521500100",
    "name": "惠安县巡特警反恐大队综合室"
}, {
    "id": "350521500200",
    "name": "惠安县巡特警反恐大队一中队（突击中队）"
}, {
    "id": "350521500300",
    "name": "惠安县巡特警反恐大队二中队（特勤中队）"
}, {
    "id": "350521500400",
    "name": "惠安县巡特警反恐大队三中队（反恐中队）"
}, {
    "id": "350521500500",
    "name": "惠安县巡特警反恐大队四中队（警训中队）"
}, {
    "id": "350524500000",
    "name": "安溪县巡特警反恐大队"
}, {
    "id": "350525500000",
    "name": "永春县巡特警反恐大队"
}, {
    "id": "350525500100",
    "name": "永春县巡特警反恐大队一中队"
}, {
    "id": "350525500200",
    "name": "永春县巡特警反恐大队二中队"
}, {
    "id": "350525500300",
    "name": "永春县巡特警反恐大队三中队"
}, {
    "id": "350526500000",
    "name": "德化县巡特警反恐大队"
}, {
    "id": "350581500000",
    "name": "石狮市公安局巡特警反恐大队"
}, {
    "id": "350582500000",
    "name": "晋江巡特警反恐大队"
}, {
    "id": "350582500100",
    "name": "晋江巡特警反恐大队综合科"
}, {
    "id": "350582500200",
    "name": "晋江巡特警反恐大队一中队"
}, {
    "id": "350582500300",
    "name": "晋江巡特警反恐大队二中队"
}, {
    "id": "350582500400",
    "name": "晋江市巡特警反恐大队三中队"
}, {
    "id": "350582500500",
    "name": "晋江巡特警反恐大队四中队"
}, {
    "id": "350583500000",
    "name": "南安巡特警反恐大队"
}, {
    "id": "350596400600",
    "name": "晋江国际机场分局巡特警反恐大队"
}, {
    "id": "350600000000",
    "name": "福建省漳州市"
}, {
    "id": "350600330000",
    "name": "漳州市公安局维稳反恐工作处"
}, {
    "id": "350600410000",
    "name": "漳州市公安局反恐怖支队"
}, {
    "id": "350602500000",
    "name": "芗城分局巡特警反恐大队"
}, {
    "id": "350602500100",
    "name": "芗城分局巡特警反恐大队勤务室"
}, {
    "id": "350602500200",
    "name": "芗城分局巡特警反恐大队一中队"
}, {
    "id": "350602500300",
    "name": "芗城分局巡特警反恐大队二中队"
}, {
    "id": "350602500400",
    "name": "芗城分局巡特警反恐大队三中队"
}, {
    "id": "350603500000",
    "name": "龙文分局巡特警反恐大队"
}, {
    "id": "350603500100",
    "name": "龙文分局巡特警反恐大队勤务室"
}, {
    "id": "350603500200",
    "name": "龙文分局巡特警反恐大队一中队"
}, {
    "id": "350603500300",
    "name": "龙文分局巡特警反恐大队二中队"
}, {
    "id": "350603500400",
    "name": "龙文分局巡特警反恐大队三中队"
}, {
    "id": "350622500000",
    "name": "云霄县巡特警反恐大队"
}, {
    "id": "350622500100",
    "name": "云霄县巡特警反恐大队一中队"
}, {
    "id": "350622500200",
    "name": "云霄县巡特警反恐大队二中队"
}, {
    "id": "350622500300",
    "name": "云霄县巡特警反恐大队三中队"
}, {
    "id": "350623500000",
    "name": "漳浦县巡特警反恐大队"
}, {
    "id": "350624500000",
    "name": "诏安县巡特警反恐大队"
}, {
    "id": "350624500100",
    "name": "诏安县巡特警反恐大队综合队"
}, {
    "id": "350624500200",
    "name": "诏安县巡特警反恐大队应急处突特勤队"
}, {
    "id": "350624500300",
    "name": "诏安县巡特警反恐大队巡防管控队"
}, {
    "id": "350625500000",
    "name": "长泰县巡特警反恐大队"
}, {
    "id": "350625500100",
    "name": "长泰县巡特警反恐大队一中队"
}, {
    "id": "350625500200",
    "name": "长泰县巡特警反恐大队二中队"
}, {
    "id": "350625500300",
    "name": "长泰县巡特警反恐大队三中队"
}, {
    "id": "350626500000",
    "name": "东山县巡特警反恐大队"
}, {
    "id": "350626500100",
    "name": "东山县巡特警反恐大队一中队"
}, {
    "id": "350626500200",
    "name": "东山县巡特警反恐大队二中队"
}, {
    "id": "350626500300",
    "name": "东山县巡特警反恐大队三中队"
}, {
    "id": "350627500000",
    "name": "南靖县巡特警反恐大队"
}, {
    "id": "350628500000",
    "name": "平和县巡特警反恐大队"
}, {
    "id": "350628500100",
    "name": "平和县巡特警反恐大队综合中队"
}, {
    "id": "350628500200",
    "name": "平和县巡特警反恐大队一中队"
}, {
    "id": "350628500300",
    "name": "平和县巡特警反恐大队二中队"
}, {
    "id": "350628500400",
    "name": "平和县巡特警反恐大队三中队"
}, {
    "id": "350629500000",
    "name": "华安县巡特警反恐大队"
}, {
    "id": "350629500100",
    "name": "华安县巡特警反恐大队一中队"
}, {
    "id": "350629500200",
    "name": "华安县巡特警反恐大队二中队"
}, {
    "id": "350629500300",
    "name": "华安县巡特警反恐大队三中队"
}, {
    "id": "350681500000",
    "name": "龙海市巡特警反恐大队"
}, {
    "id": "350681500100",
    "name": "龙海市巡特警反恐大队综合中队"
}, {
    "id": "350681500200",
    "name": "龙海市巡特警反恐大队一中队"
}, {
    "id": "350681500300",
    "name": "龙海市巡特警反恐大队二中队"
}, {
    "id": "350681500400",
    "name": "龙海市巡特警反恐大队三中队"
}, {
    "id": "350681500500",
    "name": "龙海市巡特警反恐大队四中队"
}, {
    "id": "350681500600",
    "name": "龙海市巡特警反恐大队五中队"
}, {
    "id": "350698500000",
    "name": "漳州台商投资区分局巡特警反恐大队"
}, {
    "id": "350700000000",
    "name": "福建省南平市"
}, {
    "id": "350700410000",
    "name": "南平市公安局反恐怖支队"
}, {
    "id": "350702500000",
    "name": "延平分局巡特警反恐大队"
}, {
    "id": "350721500000",
    "name": "顺昌县公安局巡特警反恐大队"
}, {
    "id": "350722500000",
    "name": "浦城县巡特警反恐大队"
}, {
    "id": "350723230500",
    "name": "光泽县巡特警反恐大队"
}, {
    "id": "350724500000",
    "name": "松溪县巡特警反恐大队"
}, {
    "id": "350725500000",
    "name": "政和县巡特警反恐大队"
}, {
    "id": "350781500000",
    "name": "邵武市局巡特警反恐大队"
}, {
    "id": "350782500000",
    "name": "武夷山市巡特警反恐大队"
}, {
    "id": "350783500000",
    "name": "建瓯市巡特警反恐大队"
}, {
    "id": "350784500000",
    "name": "建阳区巡特警反恐大队"
}, {
    "id": "350800000000",
    "name": "福建省龙岩市"
}, {
    "id": "350800410000",
    "name": "福建省龙岩市公安局反恐怖处"
}, {
    "id": "350800S04100",
    "name": "龙岩市森林公安局梅花山国家级自然保护区直属分局"
}, {
    "id": "350802500000",
    "name": "新罗分局巡特警反恐大队"
}, {
    "id": "350802500100",
    "name": "新罗分局巡特警反恐大队勤务室"
}, {
    "id": "350802500300",
    "name": "新罗分局巡特警反恐大队特警一中队"
}, {
    "id": "350802500400",
    "name": "新罗分局巡特警反恐大队特警二中队"
}, {
    "id": "350802500500",
    "name": "新罗分局巡特警反恐大队反恐中队"
}, {
    "id": "350821500000",
    "name": "长汀县巡特警反恐大队"
}, {
    "id": "350821500100",
    "name": "长汀县巡特警反恐大队综合室"
}, {
    "id": "350821500200",
    "name": "长汀县巡特警反恐大队反恐中队"
}, {
    "id": "350821500300",
    "name": "长汀县巡特警反恐大队巡逻防控中队"
}, {
    "id": "350821500400",
    "name": "长汀县巡特警反恐大队特勤中队"
}, {
    "id": "350822500000",
    "name": "永定分局巡特警反恐大队"
}, {
    "id": "350822500100",
    "name": "永定分局巡特警反恐大队一中队"
}, {
    "id": "350822500200",
    "name": "永定分局巡特警反恐大队二中队"
}, {
    "id": "350822500300",
    "name": "永定分局巡特警反恐大队反恐中队"
}, {
    "id": "350822500400",
    "name": "永定分局巡特警反恐大队综合勤务室"
}, {
    "id": "350823500000",
    "name": "上杭县巡特警反恐大队"
}, {
    "id": "350823500100",
    "name": "上杭县巡特警反恐大队综合勤务中队"
}, {
    "id": "350823500200",
    "name": "上杭县巡特警反恐大队反恐中队"
}, {
    "id": "350823500300",
    "name": "上杭县巡特警反恐大队巡逻防控中队"
}, {
    "id": "350823500400",
    "name": "上杭县巡特警反恐大队特勤中队"
}, {
    "id": "350824500000",
    "name": "武平县巡特警反恐大队"
}, {
    "id": "350825500000",
    "name": "连城县巡特警反恐大队"
}, {
    "id": "350825500100",
    "name": "连城县巡特警反恐大队综合勤务中队"
}, {
    "id": "350825500200",
    "name": "连城县巡特警反恐大队应急处突中队"
}, {
    "id": "350825500300",
    "name": "连城县巡特警反恐大队巡逻防控中队"
}, {
    "id": "350825500400",
    "name": "连城县巡特警反恐大队巡逻反恐中队"
}, {
    "id": "350881500000",
    "name": "漳平市巡特警反恐大队"
}, {
    "id": "350900000000",
    "name": "福建省宁德市"
}, {
    "id": "350900330000",
    "name": "宁德市公安局反恐怖支队"
}, {
    "id": "350902500000",
    "name": "蕉城分局巡特警反恐大队"
}, {
    "id": "350921500000",
    "name": "霞浦巡特警反恐大队"
}, {
    "id": "350922500000",
    "name": "古田县巡特警反恐大队"
}, {
    "id": "350923500000",
    "name": "屏南县巡特警反恐大队"
}, {
    "id": "350924500000",
    "name": "寿宁县巡特警反恐大队"
}, {
    "id": "350925500000",
    "name": "周宁县巡特警反恐大队"
}, {
    "id": "350926280000",
    "name": "柘荣县巡警特警反恐大队"
}, {
    "id": "350981500000",
    "name": "福安市巡特警反恐大队"
}, {
    "id": "350981500100",
    "name": "福安市巡特警反恐大队综合中队"
}, {
    "id": "350981500200",
    "name": "福安市巡特警反恐大队防暴反恐中队"
}, {
    "id": "350981500300",
    "name": "福安市巡特警反恐大队武装巡逻中队"
}, {
    "id": "350981500400",
    "name": "福安市巡特警反恐大队警情处置中队"
}, {
    "id": "350982210300",
    "name": "福鼎市国内安全保卫大队维稳与反恐中队"
}, {
    "id": "350982500000",
    "name": "福鼎市巡特警反恐大队"
}, {
    "id": "350999500000",
    "name": "宁德东侨经济技术开发区分局巡特警反恐大队"
}, {
    "id": "351000000000",
    "name": "平潭综合试验区公安局犯罪侦查支队"
}, {
    "id": "351001000000",
    "name": "福建省平潭区"
}, {
    "id": "351100T00000",
    "name": "福州铁路公安处"
}, {
    "id": "351100T02700",
    "name": "福州铁路公安处反恐怖支队"
}, {
    "id": "351200T00000",
    "name": "厦门铁路公安处"
}, {
    "id": "351200T02700",
    "name": "厦门铁路公安处反恐怖支队"
}, {
    "id": "350102700022",
    "name": "测试上下级部门门"
}]